export const actionBannerData = {
  regularFee: "17000",
  launchOfferFee: "5000",
  nextPriceUpdatedDate: "১৫ আগস্ট ২০২৫",
};
export const featuresPlanData = [
  {
    title: "১. অভিজ্ঞ এক্সপার্টদের দ্বারা তৈরি",
    points: [
      "শুধু প্রমাণিত অভিজ্ঞতাই আমাদের সঙ্গে কাজ করে।",
      "আমরা কাজ করি কেবল সেই সব এক্সপার্টদের সঙ্গে, যারা বহু বছর ধরে সফলভাবে ইন্ডাস্ট্রিতে কাজ করছেন। আপনি পাবেন ফিল্ড-টেস্টেড রিয়েল লাইফ নলেজ ও গাইডলাইন।",
    ],
  },
  {
    title: "২. সুপরিকল্পিত ও গোছানো কারিকুলাম",
    points: [
      "লার্নিং অ্যাক্টিভিটির সাথে সাজানো পাঠ্যক্রম।",
      "আমরা কাজ করি কেবল সেই সব এক্সপার্টদের সঙ্গে, যারা বহু বছর ধরে সফলভাবে ইন্ডাস্ট্রিতে কাজ করছেন। আপনি পাবেন ফিল্ড-টেস্টেড রিয়েল লাইফ নলেজ ও গাইডলাইন।",
    ],
  },
  {
    title: "৩. চাহিদাসম্পন্ন ও ভবিষ্যত-প্রস্তুত স্কিল",
    points: [
      "আজকের ও আগামীর মার্কেটের জন্য দরকারি টপিক।",
      "আমরা এমন সব বিষয় নির্বাচন করি, যেগুলোর চাহিদা এখন তুঙ্গে এবং ভবিষ্যতেও থাকবে।",
      "যে কেউ ডিজিটাল মার্কেটিং ম্যানেজ করতে চায়—এই স্কিলগুলো তাদের জন্য অপরিহার্য।",
    ],
  },
  {
    title: "৪. প্রতি মাসে নতুন কোর্স",
    points: [
      "প্রতিমাসে গড়ে ১০টি নতুন কোর্স যুক্ত হবে।",
      "প্রায়োগিক প্রাইম মেম্বাররা এই নতুন কোর্সগুলোতে পাবেন এক্সক্লুসিভ একসেস বিনামূল্যে। শেখা হবে অবিরাম, সবসময় নতুন কিছু।",
    ],
  },
  {
    title: "৫. স্ট্যান্ডার্ড ও লাইভ কোর্সে বিশেষ ছাড়",
    points: [
      "বিশেষ ডিসকাউন্টের সুবিধা থাকছে সবসময়।",
      "প্রাইম মেম্বার হিসেবে আপনি স্ট্যান্ডার্ড কোর্স, লাইভ ট্রেনিং, সার্টিফিকেশন কোর্স, ওয়ার্কশপ ও বুটক্যাম্পে পাবেন ৫০% পর্যন্ত ছাড়।",
    ],
  },
  {
    title: "৬. ক্যারিয়ার ফোকাসড ওয়েবিনার",
    points: [
      "প্রাইম মেম্বারদের জন্য নিয়মিত ফ্রি সেমিনার",
      "আপনার ক্যারিয়ার গড়ার জন্য আয়োজন করা হবে নিয়মিত অনলাইন সেমিনার ও ওয়েবিনার—যেখানে প্রাইম মেম্বাররা অংশ নিতে পারবেন একদম ফ্রিতে।",
    ],
  },
];
export const featuresMembershipData = [
  {
    title: "১. ক্যারিয়ার গড়ার সুদৃঢ় ভিত্তি",
    points: [
      "ডিজিটাল মার্কেটিং, কনটেন্ট, ডিজাইন, অটোমেশনসহ প্রয়োজনীয় স্কিল শেখার মাধ্যমে আপনি তৈরি হবেন জব রেডি।",
      "প্র্যাকটিক্যাল কোর্স ও এক্সপার্টদের গাইডলাইন আপনার ক্যারিয়ার গড়বে আরও আত্মবিশ্বাসের সঙ্গে।",
    ],
  },
  {
    title: "২. প্রফেশনাল নেটওয়ার্ক তৈরির সুযোগ",
    points: [
      "ওয়েবিনার, লাইভ সেশন ও কমিউনিটি ইভেন্টের মাধ্যমে আপনি যুক্ত হবেন বাংলাদেশের উঠতি এবং প্রতিষ্ঠিত মার্কেটারদের সঙ্গে।",
      " এই নেটওয়ার্ক ভবিষ্যতে জব, প্রজেক্ট কিংবা সুযোগ তৈরি করতে সাহায্য করবে।",
    ],
  },
  {
    title: "৩. গভীর জ্ঞান ও রিসোর্সে একসেস",
    points: [
      "প্রাইম মেম্বার হিসেবে আপনি একসেস পাচ্ছেন শতাধিক কোর্স, গাইড, চেকলিস্ট এবং আরও অনেক লার্নিং রিসোর্সে—যা আপনাকে শুধু শেখাবে না, বরং আপনার পারফরম্যান্সও উন্নত করবে।",
    ],
  },
  {
    title: "৪. অর্থ ও সময়ের সাশ্রয়",
    points: [
      "প্রতিটি কোর্স আলাদা করে না কিনে একটি মেম্বারশিপেই পাচ্ছেন বহু কোর্স।",
      "সাথে স্ট্যান্ডার্ড, লাইভ ও সার্টিফিকেশন কোর্সেও থাকছে বিশেষ ডিসকাউন্ট—শেখা হবে আরও সাশ্রয়ী।",
    ],
  },
  {
    title: "৫. একটিভ কমিউনিটি ও সাপোর্ট",
    points: [
      "প্রাইম মেম্বারদের জন্য আছে একটি একটিভ লার্নিং কমিউনিটি, যেখানে আপনি প্রশ্ন করতে পারবেন, পরামর্শ পেতে পারেন, এবং অন্যদের অভিজ্ঞতা থেকেও শিখতে পারবেন।",
    ],
  },
  {
    title: "৬. রি-স্কিল ও আপ-স্কিল করার পূর্ণ সুযোগ",
    points: [
      "চাকরির প্রস্তুতি নিচ্ছেন, ক্যারিয়ার শিফট করছেন, না কি নিজের স্কিলকে আরও শার্প করছেন—প্রাইম মেম্বারশিপ আপনার প্রতিটি ধাপে সাহায্য করবে নতুন ও আপডেটেড স্কিল শিখতে।",
    ],
  },
];


export const mentorsFeedbackData = [
  {
    src: "https://youtube.com/shorts/JXgSucb3o04?feature=share",
    alt: "Video 1",
    imageSrc: "/images/placeholder1.jpg",
  },

  {
    src: "https://youtube.com/shorts/VbmwQqWUPGg?feature=share",
    alt: "Video 2",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/-NWbtBHKk8g?feature=share",
    alt: "Video 3",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/JXgSucb3o04?feature=share",
    alt: "Video 4",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/VbmwQqWUPGg?feature=share",
    alt: "Video 5",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/-NWbtBHKk8g?feature=share",
    alt: "Video 6",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/eSNNTd9fyA4?feature=share",
    alt: "Video 7",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/6nf_zP460GI?feature=share",
    alt: "Video 8",
    imageSrc: "/images/placeholder1.jpg",
  },
];
