import React from "react";
import FaqComponent from "@/components/FaqComponent";
import SectionTitle from "@/components/common/SectionTitle";

const RoadmapFaq = () => {
  const roadmapFaqs = [
    {
      question: "প্রায়োগিক কোর্স রোডম্যাপ কী?",
      answer:
        "প্রায়োগিক কোর্স রোডম্যাপ হলো আমাদের ডিজিটাল স্কিল ও ডিজিটাল মার্কেটিংয়ের প্রয়োজনীয়, যুগোপযোগী এবং ইন-ডিমান্ড স্কিলভিত্তিক কোর্সগুলোর ভবিষ্যৎ পরিকল্পনা এবং বিস্তারিত তথ্য। এখানে বুঝানো হয় আমরা কোন কোন স্কিল নিয়ে কাজ করছি, ভবিষ্যতে কী কোর্স যুক্ত হবে, এবং ব্যবহারকারীরা কীভাবে কোর্সগুলোতে অংশ নিতে পারবেন। ",
    },
    {
      question: "কারা এই কোর্সগুলোতে ভর্তি হতে পারেন?",
      answer:
        "শিক্ষার্থী, পেশাদার, চাকরিপ্রার্থী, ফ্রিল্যান্সার কিংবা যারা ডিজিটাল স্কিলে দক্ষতা অর্জন করতে চান—সবার জন্য এই কোর্সগুলো উন্মুক্ত।",
    },
    {
      question: "ভবিষ্যতে নতুন কোর্স যুক্ত করার পরিকল্পনা আছে কি?",
      answer:
        "আমাদের রোডম্যাপে নিয়মিত নতুন প্রয়োজনীয় স্কিল ও ইন-ডিমান্ড কোর্স যুক্ত করার পরিকল্পনা আছে। ব্যবহারকারীদের চাহিদা ও চাকরির বাজারের প্রবণতা অনুযায়ী কোর্সের সংখ্যা বাড়ানো হবে।",
    },
    {
      question: "কোর্স শেষ করলে কি সার্টিফিকেট দেওয়া হয়?",
      answer:
        "হ্যাঁ, প্রতিটি কোর্স সফলভাবে সম্পন্ন করলে অংশগ্রহণকারীরা ডিজিটাল সার্টিফিকেট পাবেন, যা চাকরি কিংবা ফ্রিল্যান্সিংয়ে স্কিল প্রমাণে কাজে লাগবে।",
    },
    {
      question: "কোর্স কনটেন্ট ও সিলেবাস কোথায় পাব?",
      answer:
        "প্রতিটি কোর্সের বিস্তারিত কনটেন্ট, সিলেবাস এবং শেখার মডিউল/স্ট্রাকচার কোর্সের বিস্তারিত পেইজে প্রকাশিত হয়, সেখানে গিয়ে পাওয়া যাবে।",
    },
    {
      question: "কোর্স সম্পন্ন করতে কত সময় লাগবে?",
      answer:
        "প্রতিটি কোর্সের সময়সীমা সাধারণত ৩০ মিনিট থেকে ৯০ মিনিটের মধ্যে হবে।",
    },
    {
      question: "যদি কোর্স চলাকালে কোনো সমস্যা হয়, কাকে জানাতে পারি?",
      answer:
        "কোর্স চলাকালীন যেকোনো সমস্যা বা জিজ্ঞাসার জন্য আমাদের সাপোর্ট টিমে সরাসরি যোগাযোগ করা যাবে। ফোন নম্বর ও ইমেইল ওয়েবসাইটে দেওয়া আছে।",
    },
    {
      question: "কোর্সের পর ক্যারিয়ার সহায়তা পাবো কি?",
      answer:
        "আমাদের লার্নারদের জন্য ক্যারিয়ার গাইডেন্স, সিভি/রেজ্যুমে তৈরি এবং চাকরির সুযোগ সম্পর্কে পরামর্শ দেওয়া হয়।",
    },
    {
      question: "অনলাইন ও অফলাইন দুই মাধ্যমেই কি কোর্স করা যাবে?",
      answer:
        "আমাদের সব ধরনের কোর্স অনলাইনে সম্পন্ন করা যায়, আপাতত আমাদের কোন অফলাইন কোর্স নাই। বিস্তারিত কোর্স পেইজে উল্লেখ আছে।",
    },
  ];

  return (
    <>
      <div>
        <SectionTitle
          title="কোর্স সম্পর্কিত সাধারণ প্রশ্ন"
          description="প্রায়োগিক কোর্স নিয়ে সব সাধারণ প্রশ্নের উত্তর সহজে খুঁজে পান এখানে।"
        />
        <div className="px-6 xl:px-0 pb-8">
          <FaqComponent faqItems={roadmapFaqs} showRightSection={false} />
        </div>
      </div>
    </>
  );
};

export default RoadmapFaq;
