"use client";
import React from "react";
import { Card, CardContent } from "@/components/ui/card";
import Image from "next/image";
import { Button } from "@/components/ui/button";
import QouteIcon from "../_utils/QouteIcon";
import SectionTitle from "@/components/common/SectionTitle";
import { ArrowRight } from "lucide-react";
import Link from "next/link";
import TestimonialModal from "@/components/common/TestimonialModal";
// import { roadmapTestimonials } from "@/data/testimonials-data";

const StudentFeedback = () => {
  const bgColors = ["bg-[#F8F3E9]", "bg-[#E9F8F2]", "bg-[#EEF8E9]"];
  const roadmapTestimonials = [
    {
      id: 1,
      title: "",
      name: "নজরুল ইসলাম",
      text: "প্রায়োগিকের কোর্সে আমার সেরা অভিজ্ঞতা। ডিজিটাল মার্কেটার ও অনলাইন বিজনেস এর জন্য এই প্লাটফর্ম অনেক কার্যকর। টপিক গুলো সংক্ষিপ্ত ও প্রাকটিক্যাল হয়াতে শেখা সহজ এবং আরও কার্যকর হবে লার্নারদের জন্য। ভিডিও ও অডিও কোয়ালিটি অনেক ভালো। নতুন কিছু শেখার জন্য অনেক উপকারী। ডিজিটাল মার্কেটিং শেখার জন্য অনেক দারুন প্লাটফর্ম। শিক্ষার্থীরা নতুন কিছু বাস্তবে কাজে লাগানোর সেরা প্লাটফর্ম, ইনশাল্লাহ।",
      avatar: "/reviews/nazrul.webp",
      bgColor: bgColors[0],
    },
    {
      id: 2,
      title: "",
      name: "শফিকুল ইসলাম",
      text: 'আমি "Prayogik" প্ল্যাটফর্ম থেকে কয়েকটি কোর্স করেছি এবং শেখার অভিজ্ঞতাটা বেশ ভালো লেগেছে। কোর্সগুলো ছোট ছোট মডিউলে সাজানো, তাই সময় কম লাগলেও সহজে বোঝা যায়। কনটেন্টগুলো খুব বেশি জটিল নয়, তবে পরিষ্কারভাবে ব্যাখ্যা করা হয়েছে এবং বাস্তব উদাহরণও ছিল। এতে বিষয়গুলো বুঝতে সুবিধা হয়েছে। আমার মনে হয়েছে, যদি কিছু কোর্সে রিয়েল প্রজেক্ট-ভিত্তিক অ্যাসাইনমেন্ট থাকত, তাহলে আরও ভালো হতো। সব মিলিয়ে, যারা নতুন স্কিল শিখতে চান তাদের জন্য এটি একটি কার্যকর প্ল্যাটফর্ম। আমার অভিজ্ঞতা ইতিবাচক ছিল এবং আমি অন্যদেরও এটি ব্যবহার করতে বলব',
      avatar: "/reviews/shafikul.webp",
      bgColor: bgColors[2],
    },
    {
      id: 3,
      title: "",
      name: "রুদ্রনীল সৌরভ",
      text: "প্রায়োগিকের এই উদ্যোগ সত্যিই প্রশংসনীয়। এখানে বহুমুখী লার্নিং এর ব্যবস্থা থাকার কারণে শিক্ষার্থীরা বাস্তব কাজ শেখার আত্মবিশ্বাস অর্জন করতে পারবে বলে আমি মনে করি। কোর্সগুলো বিগিনার ফ্রেন্ডলি থেকে শুরু করে অ্যাডভান্সড লেভেল পর্যন্ত আপডেটেড কনটেন্টে ভরপুর। আমি নিজে এখান থেকে ভ্যালু পেয়েছি এবং আত্মবিশ্বাসের সঙ্গে বলতে পারি—আমি নির্দ্বিধায় প্রায়োগিকের কোর্সগুলো অন্যদের রিকমেন্ড করব।",
      avatar: "/reviews/rudroneel.png",
      bgColor: bgColors[1],
    },
    {
      id: 4,
      title: "",
      name: "আতিকুর রহমান",
      text: "প্রায়োগীক এর ব্যাপারে একটাই কথা, এখানে যারা শেখায় তারা স্ব বিষয়ে অভিজ্ঞ। তাই প্রায়োগীক বিশ্বাস করি। এগিয়ে যাক প্রায়োগীক।",
      avatar: "",
      bgColor: bgColors[2],
    },
    {
      id: 5,
      title: "",
      name: "এম. ডি. কামরুল হাসান",
      text: "কোর্সটি আমার প্রত্যাশার থেকেও বেশি মূল্য দিয়েছে। কোর্সের বিষয়বস্তু খুবই প্রাসঙ্গিক ও বাস্তবমুখী। বাস্তব উদাহরণের মাধ্যমে কৌশল শেখানো হয়েছে, যা আমার পেশাগত দক্ষতা উন্নত করতে দারুণ সহায়ক হয়েছে। যদি কারো কিছু শেখার আগ্রহ থাকে নিঃসন্দেহে এই প্লাটফর্ম থেকে শিখতে পারেন যা আপনার স্কিল ডেভলপমেন্ট করতে সাহায্য করবে। সর্বপরি এটা বলতে পারি প্রায়োগিক হচ্ছে দেশ সেরা অনলাইন আইটি ট্রেনিং প্লাটফর্ম।",
      avatar: "/reviews/kamrul.webp",
      bgColor: bgColors[1],
    },
    {
      id: 6,
      title: "",
      name: "মো. আল-আমিন ইসলাম",
      text: "প্রোয়োগিকের এই উদ্যোগ নিঃসন্দেহে প্রশংসনীয়। আমি মনে করি এই প্লাটফর্মের মাধ্যমে শিক্ষার্থীরা অনেক উপকৃত হবে। আমি শর্ট কোর্স থেকে আমি বাস্তব অর্থেই অনেক জ্ঞান অর্জন করেছি। তাই আমি প্রোয়োগিকের এই প্লাটফর্মের কোর্সগুলো আমি নিরদ্বিধায় রেকোমেন্ড করছি।",
      avatar: "",
      bgColor: bgColors[0],
    },
    {
      id: 7,
      title: "",
      name: "আশরাফুল আলম",
      text: "আমি প্রায়োগিকের কয়েকটি প্রফেশনাল কোর্স করেছি। এর মধ্যে SaaS Go-To-Market Strategy, Mastering Content Strategy, B2B Outbound Marketing Automation কোর্সগুলো আমার কাছে সবচেয়ে বেশি মূল্যবান লেগেছে। প্রতিটি কোর্সের কনটেন্ট ছিল সুসংগঠিত এবং বাস্তব অভিজ্ঞতার উপর ভিত্তি করে তৈরি। শেখার প্রক্রিয়াটা ছিল সহজবোধ্য, ফলে নতুন বিষয়গুলোও ভালোভাবে আয়ত্ত করতে পেরেছি। এগুলো করার পর কাজের জায়গায় সরাসরি প্রয়োগ করার মতো কিছু কৌশল শিখেছি, যেটা আমার জন্য সবচেয়ে বড় অর্জন। আমার কাছে এটি একটি ইতিবাচক অভিজ্ঞতা ছিল এবং শেখার দিক থেকে আমি অনেক উপকৃত হয়েছি।",
      avatar: "",
      bgColor: bgColors[2],
    },
    {
      id: 8,
      title: "",
      name: "অরিদ্র চন্দ্র দাস",
      text: '"প্রায়োগিক" নিয়ে যদি এক বাক্যে বলি তাহলে বলবো, এটি হলো একটি ই-লাইব্রেরী। না, এটি বইয়ের কোনো লাইব্রেরী নয়, স্কিল ডেভেলপমেন্টের অনলাইন লাইব্রেরী। যেখানে আপনি একটি সাবস্ক্রিপশনের মাধ্যমে বিভিন্ন ধরনের প্রয়োজনীয় কোর্স করতে পারবেন। যেহেতু আমরা সব স্কিলে পারদর্শী হতে পারবো না, তবুও আমাদের প্রধান স্কিলের পাশাপাশি অন্যান্য স্কিলগুলো সম্পর্কেও ধারণা রাখতে হয়। কিন্তু এক্ষেত্রে আমাদের সমস্যা হলো আমারা সঠিক কোর্স/ মেন্টরের সন্ধান পাই না। আর পেলেও আলাদা আলাদা করে কোর্স কিনতে হয় যা আমাদের দেশের প্রেক্ষাপটে অত্যন্ত ব্যয় এবং সময়সাপেক্ষ। আর "প্রায়োগিক" এই সবকিছুর সমাধান নিয়ে এসেছে।',
      avatar: "",
      bgColor: bgColors[0],
    },
    {
      id: 9,
      title: "",
      name: "মো. সাইদুল ইসলাম",
      text: 'আমি "প্রায়োগিক" প্ল্যাটফর্ম এবং বিশেষ করে "Outbeat Link Building Masterclass" নিয়ে আমার অভিজ্ঞতা শেয়ার করতে চাই। সত্যি বলতে, আমি দেশ-বিদেশের অনেক কোর্স করেছি, কিন্তু এত গুছানো, সহজবোধ্য এবং প্র্যাকটিক্যাল কোর্স আগে পাইনি। সবচেয়ে ভালো লেগেছে ট্রেইনার আবুল কাশেম ভাইয়ের টিচিং স্কিলস। তিনি শুধু থিওরি শেখান না, বরং বাস্তব উদাহরণ দিয়ে বিষয়গুলো এমনভাবে বুঝিয়ে দেন যে জটিল জিনিসও একদম ক্লিয়ার হয়ে যায়। প্রায়োগিকের কোর্সগুলো সত্যিই নামের মতোই "প্রায়োগিক।" এখানে শুধু বইয়ের মতো তথ্য নয়, বরং কীভাবে কাজ করতে হয় তা হাতে-কলমে শেখানো হয়।',
      avatar: "",
      bgColor: bgColors[2],
    },
    {
      id: 10,
      title: "",
      name: "হাসান তাওসিফ",
      text: 'প্রায়োগিক প্ল্যাটফর্মটা আমার কাছে একেবারেই ভিন্ন লেগেছে। এখানে শুধু বইয়ের মতো তত্ত্ব না, বরং বাস্তব জীবনে কীভাবে কাজ করতে হয় সেটাই শেখানো হয়। নামের মতোই সত্যিকারের "প্রায়োগিক" শেখা। ভবিষ্যতে তারা যেভাবে আরও কোর্স, আন্তর্জাতিক মানের কনটেন্ট আর ক্যারিয়ার গড়ার সুযোগ তৈরি করতে চাচ্ছে – সেটা সত্যিই অনুপ্রেরণাদায়ক। আমার মনে হয় এই উদ্যোগটা বাংলাদেশের তরুণদের জন্য অনেক দরকার ছিল।',
      avatar: "/reviews/facebook/HaSan-TaWsif.webp",
      bgColor: bgColors[1],
    },
    {
      id: 11,
      title: "",
      name: "তারিক নাহিদ",
      text: "আমি প্রায়োগিকের কয়েকটা কোর্স এক্সপ্লোর করেছি, বিশেষ করে SEO আর Outreach সম্পর্কিত। সত্যি বলতে নতুনদের জন্য এগুলো অনেক হেল্পফুল। যেভাবে ধাপে ধাপে বুঝিয়ে বলা হয়েছে, তাতে একদম বেসিক থেকে শুরু করে ইন্টারমিডিয়েট লেভেল পর্যন্ত সবাই সহজেই বুঝতে পারবে। আমার ভালো লেগেছে যে, তারা শুধু থিওরি নয়, বরং রিয়েল এক্সাম্পল দিয়ে শেখানোর চেষ্টা করেছে। বাংলাদেশে যারা নতুন করে ডিজিটাল মার্কেটিং বা SEO শিখতে চাইছে, তাদের জন্য এই প্ল্যাটফর্মটা ভীষণ কাজে আসবে।",
      avatar: "/reviews/facebook/Tariq-Nahid.webp",
      bgColor: bgColors[0],
    },
    {
      id: 12,
      title: "",
      name: "মো. আবু ওবায়দা জায়েদ",
      text: "প্রায়োগিক প্ল্যাটফর্মের উদ্যোগ সত্যিই প্রশংসনীয়। আমাদের মতো শিক্ষার্থীদের জন্য বাস্তব জীবনে প্রয়োজনীয় স্কিল নিয়ে কোর্স করানো হচ্ছে, যা অন্য জায়গায় সচরাচর পাওয়া যায় না। আমি ফেসবুক এ্যাওয়ার্নেস কোর্স করেছি এবং দেখেছি অল্প সময়ের মধ্যে স্পষ্টভাবে মূল বিষয়গুলো তুলে ধরা হয়েছে। শেখার অভিজ্ঞতা খুবই ইন্টারেক্টিভ এবং সহজবোধ্য। ভবিষ্যতে আরও ডিজিটাল মার্কেটিং ও স্কিল ডেভেলপমেন্ট সম্পর্কিত কোর্স এলে তা অনেক উপকারে আসবে বলে মনে করি।",
      avatar: "/reviews/facebook/Abu-Obaida-Zayed.webp",
      bgColor: bgColors[1],
    },
  ];

  return (
    <div>
      <SectionTitle
        title="স্টুডেন্টদের সাফল্যের কথা"
        description="সাধারণ থেকে অসাধারণ হয়ে ওঠার এক অবিশ্বাস্য সফলতার গল্প।"
      />
      <div className="px-6 md:px-8 lg:px-8 xl:px-8 2xl:px-0 max-w-7xl mx-auto ">
        {/* grid layout */}
        <div className="columns-1 md:columns-2 lg:columns-3 xl:columns-3 gap-4">
          {roadmapTestimonials.map((testimonial, index) => (
            <Card
              key={testimonial.id}
              className={`${testimonial.bgColor} border-0 shadow-sm break-inside-avoid mb-6`}
              style={{
                animationDelay: `${index * 50}ms`,
              }}
            >
              <CardContent className="p-6">
                {/* Quote Icon */}
                <div className="mb-4">
                  <QouteIcon />
                </div>
                <TestimonialModal testimonial={testimonial} />

                {/* Divider */}
                <hr className="mb-4 border-gray-300" />

                {/* Profile Section */}
                <div className="flex items-center gap-3">
                  <div className="relative aspect-square w-10 h-10">
                    <Image
                      src={testimonial.avatar || "/reviews/default.png"}
                      alt={`${testimonial.name}'s profile picture`}
                      width={80}
                      height={80}
                      quality={75}
                      className="rounded-full object-cover w-full h-full"
                      loading="eager"
                      sizes="40px"
                    />
                  </div>
                  <div>
                    <h4 className="font-semibold text-gray-900 text-base">
                      {testimonial.name}
                    </h4>
                    {testimonial.title && (
                      <p className="text-gray-600 text-sm">
                        {testimonial.title}
                      </p>
                    )}
                  </div>
                </div>
              </CardContent>
            </Card>
          ))}
        </div>

        {/* Show More Button */}
        <div className="flex justify-center mt-12">
          <Link
            target="_blank"
            href="https://www.trustpilot.com/review/prayogik.com"
          >
            <Button
              variant="outline"
              className="text-gray-700 p-6 font-semibold border-gray-300 leading-6 transition-colors duration-300 h-12 cursor-pointer md:flex"
            >
              আরো দেখুন <ArrowRight className="w-5 h-5 ml-1 font-extralight" />
            </Button>
          </Link>
        </div>
      </div>
    </div>
  );
};

export default StudentFeedback;
