import Link from "next/link";
import React from "react";

export default function page() {
  return (
    <div className="max-w-4xl py-10 mx-auto lg:py-16">
      <div className="w-full p-8 overflow-hidden bg-white rounded-lg drop-shadow md:p-10">
        <h1 className="mt-2 text-3xl md:text-3xl font-bold mb-[30px]">
          প্রাইভেসি পলিসি
        </h1>
        {/* Content */}
        <div className="space-y-[30px]">
          <p className="text-base text-gray-700">
            প্রায়োগিক-এ আমরা আপনার গোপনীয়তা রক্ষায় প্রতিশ্রুতিবদ্ধ এবং আপনার
            ব্যক্তিগত তথ্যকে যত্ন সহকারে পরিচালনা করার নিশ্চয়তা দিচ্ছি। এই
            প্রাইভেসি পলিসি আমাদের ওয়েবসাইট www.prayogik.com এ আপনার ভিজিটের
            সময় আমরা কীভাবে আপনার তথ্য সংগ্রহ, ব্যবহার এবং সুরক্ষিত করি তা
            ব্যাখ্যা করে।
          </p>
          <p className="flex flex-col text-base text-gray-700">
            <span className="font-bold text-gray-950">
              ১. আমরা যে তথ্য সংগ্রহ করি:
            </span>{" "}
            <span>
              আমরা আপনার ব্যক্তিগত তথ্য সংগ্রহ করি যখন আপনি আমাদের কোর্সগুলিতে
              নিবন্ধন করেন, একটি অ্যাকাউন্ট তৈরি করেন বা আমাদের সাথে যোগাযোগ
              করেন। এর মধ্যে আপনার নাম, ইমেল ঠিকানা, পেমেন্টের তথ্য এবং কোর্সের
              জন্য প্রয়োজনীয় অন্যান্য তথ্য অন্তর্ভুক্ত থাকতে পারে।
            </span>
          </p>

          <p className="flex flex-col text-base text-gray-700">
            <span className="font-bold text-gray-950">
              ২. আমরা আপনার তথ্য কীভাবে ব্যবহার করি:
            </span>{" "}
            আমরা আপনার ব্যক্তিগত তথ্য ব্যবহার করি আমাদের কোর্সগুলিতে আপনার
            অ্যাক্সেস প্রদান করতে, পেমেন্ট প্রক্রিয়া করতে, আপনাকে আপনার কোর্স
            সম্পর্কিত আপডেট এবং বিজ্ঞপ্তি পাঠাতে এবং আমাদের পরিষেবাগুলির মান
            উন্নত করতে। এছাড়াও, আমরা আপনার প্রশ্নের উত্তর দিতে এবং গ্রাহক
            সহায়তা প্রদান করতে আপনার তথ্য ব্যবহার করতে পারি।
          </p>
          <p className="flex flex-col text-base text-gray-700">
            <span className="font-bold text-gray-950">৩. ডেটা সুরক্ষা:</span>{" "}
            আমরা আপনার ব্যক্তিগত তথ্যকে অননুমোদিত অ্যাক্সেস, প্রকাশ বা অপব্যবহার
            থেকে সুরক্ষিত রাখতে শিল্প-মানের নিরাপত্তা ব্যবস্থা প্রয়োগ করি। তবে,
            ইন্টারনেটের মাধ্যমে ট্রান্সমিশন বা ইলেকট্রনিক স্টোরেজের কোনো পদ্ধতি
            ১০০% নিরাপদ নয়, এবং আমরা সর্বাধিক সুরক্ষা নিশ্চিত করতে পারি না।
          </p>
          <p className="flex flex-col text-base text-gray-700">
            <span className="font-bold text-gray-950">
              ৪. তৃতীয় পক্ষের পরিষেবা:{" "}
            </span>{" "}
            আমরা তৃতীয় পক্ষের পরিষেবা যেমন পেমেন্ট প্রোসেসর ব্যবহার করতে পারি,
            যারা আমাদের পরিষেবা প্রদানে সহায়তা করে। এই তৃতীয় পক্ষগুলি
            শুধুমাত্র তাদের কাজ সম্পাদনের জন্য প্রয়োজনীয় পরিমাণ তথ্য অ্যাক্সেস
            করতে পারে এবং তারা এটির গোপনীয়তা বজায় রাখতে বাধ্য।
          </p>
          <p className="flex flex-col text-base text-gray-700">
            <span className="font-bold text-gray-950">৫. আপনার অধিকার:</span>{" "}
            <span>
              আপনার ব্যক্তিগত তথ্য অ্যাক্সেস, আপডেট বা মুছে ফেলার অধিকার রয়েছে।
              আপনি যদি এই অধিকারগুলি প্রয়োগ করতে চান বা আপনার গোপনীয়তা
              সম্পর্কে কোনও উদ্বেগ থাকে, অনুগ্রহ করে আমাদের সাথে{" "}
              <Link href="#" className="font-semibold text-gray-950">
                যোগাযোগ
              </Link>{" "}
              করুন।
            </span>
          </p>
          <p className="flex flex-col text-base text-gray-700">
            <span className="font-bold text-gray-950">
              ৬. এই নীতিতে পরিবর্তন:
            </span>{" "}
            আমরা সময়ে সময়ে এই প্রাইভেসি পলিসি আপডেট করতে পারি। কোনও পরিবর্তন
            হলে তা এই পৃষ্ঠায় পোস্ট করা হবে, এবং পলিসির সর্বশেষ সংশোধনের তারিখ
            উপরে উল্লেখ করা হবে।
          </p>
          <p className="flex gap-1 text-base text-gray-700">
            আপনার যদি আমাদের প্রাইভেসি পলিসি সম্পর্কে কোনও প্রশ্ন থাকে, অনুগ্রহ
            করে আমাদের সাথে{" "}
            <Link href="#" className="font-semibold text-gray-950">
              যোগাযোগ
            </Link>{" "}
            করুন।
          </p>
        </div>
      </div>
    </div>
  );
}
