export const actionBannerData = {
  regularFee: "17000",
  launchOfferFee: "5000",
  nextPriceUpdatedDate: "১৫ আগস্ট ২০২৫",
};
export const featuresPlanData = [
  {
    title: "১. অভিজ্ঞ এক্সপার্টদের দ্বারা তৈরি",
    points: [
      "শুধু প্রমাণিত অভিজ্ঞরাই আমাদের সঙ্গে কাজ করে।",
      "আমরা কাজ করি কেবল সেই সব এক্সপার্টদের সঙ্গে, যারা বহু বছর ধরে সফলভাবে ইন্ডাস্ট্রিতে কাজ করছেন। আপনি পাবেন ফিল্ড-টেস্টেড রিয়েল লাইফ নলেজ ও গাইডলাইন।",
    ],
  },
  {
    title: "২. সুপরিকল্পিত ও গোছানো কারিকুলাম",
    points: [
      "লার্নিং অ্যাক্টিভিটির সাথে সাজানো পাঠ্যক্রম।",
      // "আমরা কাজ করি কেবল সেই সব এক্সপার্টদের সঙ্গে, যারা বহু বছর ধরে সফলভাবে ইন্ডাস্ট্রিতে কাজ করছেন। আপনি পাবেন ফিল্ড-টেস্টেড রিয়েল লাইফ নলেজ ও গাইডলাইন।",
    ],
  },
  {
    title: "৩. চাহিদাসম্পন্ন ও ভবিষ্যতের জন্য উপযোগী স্কিলের কোর্স",
    points: [
      "যে স্কিলগুলো আজকের চাকরির বাজারে (জব মার্কেটে/ ক্যারিয়ারে) সবচেয়ে বেশি প্রয়োজন সে রিলেটেড কোর্স।",
      "ভবিষ্যতের প্রযুক্তি, ট্রেন্ড ও ইন্ডাস্ট্রি চাহিদা অনুযায়ী স্কিল রিলেটেড কোর্স।",
    ],
  },
  {
    title: "৪. প্রতি মাসে নতুন কোর্স",
    points: [
      "প্রতিমাসে গড়ে ১০টি নতুন কোর্স যুক্ত হবে।",
      "প্রায়োগিক প্রাইম মেম্বাররা এই নতুন কোর্সগুলোতে পাবেন এক্সক্লুসিভ একসেস বিনামূল্যে। শেখা হবে অবিরাম, সবসময় নতুন কিছু।",
    ],
  },
  {
    title: "৫. স্ট্যান্ডার্ড ও লাইভ কোর্সে বিশেষ ছাড়",
    points: [
      "বিশেষ ডিসকাউন্টের সুবিধা থাকছে সবসময়।",
      "প্রাইম মেম্বার হিসেবে আপনি স্ট্যান্ডার্ড কোর্স, লাইভ ট্রেনিং, সার্টিফিকেশন কোর্স, ওয়ার্কশপ ও বুটক্যাম্পে পাবেন ৫০% পর্যন্ত ছাড়।",
    ],
  },
  {
    title: "৬. ক্যারিয়ার ফোকাসড ওয়েবিনার ও সেমিনার",
    points: [
      "প্রাইম মেম্বারদের জন্য নিয়মিত ফ্রি সেমিনার",
      "আপনার ক্যারিয়ার গড়ার জন্য আয়োজন করা হবে নিয়মিত ওয়েবিনার—যেখানে প্রাইম মেম্বাররা অংশ নিতে পারবেন একদম ফ্রিতে।",
    ],
  },
];
export const featuresMembershipData = [
  {
    title: "১. ক্যারিয়ার গড়ার সুদৃঢ় ভিত্তি",
    points: [
      "ডিজিটাল মার্কেটিং, কনটেন্ট, ডিজাইন, অটোমেশনসহ প্রয়োজনীয় স্কিল শেখার মাধ্যমে আপনি তৈরি হবেন জব রেডি।",
      "প্র্যাকটিক্যাল কোর্স ও এক্সপার্টদের গাইডলাইন আপনার ক্যারিয়ার গড়বে আরও আত্মবিশ্বাসের সঙ্গে।",
    ],
  },
  {
    title: "২. প্রফেশনাল নেটওয়ার্ক তৈরির সুযোগ",
    points: [
      "ওয়েবিনার, লাইভ সেশন ও কমিউনিটি ইভেন্টের মাধ্যমে আপনি যুক্ত হবেন বাংলাদেশের উঠতি এবং প্রতিষ্ঠিত মার্কেটারদের সঙ্গে।",
      " এই নেটওয়ার্ক ভবিষ্যতে জব, প্রজেক্ট কিংবা সুযোগ তৈরি করতে সাহায্য করবে।",
    ],
  },
  {
    title: "৩. গভীর জ্ঞান ও রিসোর্সে একসেস",
    points: [
      "প্রাইম মেম্বার হিসেবে আপনি একসেস পাচ্ছেন শতাধিক কোর্স, গাইড, চেকলিস্ট এবং আরও অনেক লার্নিং রিসোর্সে—যা আপনাকে শুধু শেখাবে না, বরং আপনার পারফরম্যান্সও উন্নত করবে।",
    ],
  },
  {
    title: "৪. অর্থ ও সময়ের সাশ্রয়",
    points: [
      "প্রতিটি কোর্স আলাদা করে না কিনে একটি মেম্বারশিপেই পাচ্ছেন বহু কোর্স।",
      "সাথে স্ট্যান্ডার্ড, লাইভ ও সার্টিফিকেশন কোর্সেও থাকছে বিশেষ ডিসকাউন্ট—শেখা হবে আরও সাশ্রয়ী।",
    ],
  },
  {
    title: "৫. একটিভ কমিউনিটি ও সাপোর্ট",
    points: [
      "প্রাইম মেম্বারদের জন্য আছে একটি একটিভ লার্নিং কমিউনিটি, যেখানে আপনি প্রশ্ন করতে পারবেন, পরামর্শ পেতে পারেন, এবং অন্যদের অভিজ্ঞতা থেকেও শিখতে পারবেন।",
    ],
  },
  {
    title: "৬. রি-স্কিল ও আপ-স্কিল করার পূর্ণ সুযোগ",
    points: [
      "চাকরির প্রস্তুতি নিচ্ছেন, ক্যারিয়ার শিফট করছেন, না কি নিজের স্কিলকে আরও শার্প করছেন—প্রাইম মেম্বারশিপ আপনার প্রতিটি ধাপে সাহায্য করবে নতুন ও আপডেটেড স্কিল শিখতে।",
    ],
  },
];
export const mentorsFeedbackData = [
  {
    src: "https://youtube.com/shorts/6kIwab8hlGo",
    alt: "Video 1",
    imageSrc: "/images/placeholder1.jpg",
  },

  {
    src: "https://youtube.com/shorts/lK1oLQ6uAOA",
    alt: "Video 2",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/9xnb4QfWQhA",
    alt: "Video 3",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/AisxBR2qIrc",
    alt: "Video 4",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/zQj5tTe1ejg",
    alt: "Video 5",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/3_UOIDjgwMU",
    alt: "Video 6",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/5FrgF1F0ML0",
    alt: "Video 7",
    imageSrc: "/images/placeholder1.jpg",
  },
  {
    src: "https://youtube.com/shorts/js9QwdChBsA",
    alt: "Video 8",
    imageSrc: "/images/placeholder1.jpg",
  },
];

export const featuresRoadmapData = [
  {
    title: "১. মূল শেখার সুবিধা",
    points: [
      "এই কোর্সের মাধ্যমে আপনি ইন্ডাস্ট্রি-স্ট্যান্ডার্ড টুল ও প্র্যাকটিস শিখে জব-রেডি হতে পারবেন।",
      "ফ্রিল্যান্সিং এবং রিমোট জবের জন্য প্রয়োজনীয় দিকনির্দেশনা ও সহায়তা পাবেন।",
      "শুধু থিওরি নয়, ইন্ডাস্ট্রি-স্ট্যান্ডার্ড টুল দিয়ে প্র্যাকটিক্যালভাবে প্রোজেক্ট তৈরি করে শেখা।",
      "ফ্রিল্যান্সিং ও রিমোট জব প্রস্তুতি।",
      "এক্সপার্ট মেন্টরের কাছ থেকে রিয়েল-টাইম গাইডলাইন ও ফিডব্যাক পাওয়ার সুযোগ।",
    ],
  },
  {
    title: "২. সাপোর্ট ও উন্নতির সুবিধা",
    points: [
      "আপনি ফেসবুক গ্রুপ বা ডিসকর্ডের মাধ্যমে কমিউনিটি সাপোর্ট পাবেন।",
      "আপনার জন্য নিয়মিত লাইভ প্রশ্নোত্তর সেশন এবং ওয়েবিনার আয়োজন করা হবে।",
      "পার্সোনালাইজড লার্নিং পাথ (আপনার স্কিল লেভেল অনুযায়ী)।",
      "সার্টিফিকেট যা CV ও LinkedIn-এ ব্যবহারযোগ্য।",
    ],
  },
  {
    title: "৩. অতিরিক্ত মূল্য ও মোটিভেশন",
    points: [
      "বোনাস রিসোর্স (টেমপ্লেট, চিটশিট, রিসোর্স লিস্ট)।",
      "প্রোজেক্ট প্রদর্শনের সুযোগ (Portfolio Showcasing)।",
      "হায়ারিং পার্টনার ও রেফারেলের মাধ্যমে ইন্ডাস্ট্রি কানেকশনের সুযোগ।",
      "আপনার প্রোজেক্টগুলো প্রদর্শনের মাধ্যমে আকর্ষণীয় পোর্টফোলিও তৈরির সুযোগ, যা চাকরি পেতে সহায়ক।",
      "লিমিটেড টাইম ডিসকাউন্ট।",
    ],
  },
];
