export const BootcampSummary = () => {
  return (
    <article className="mt-10">
      <h2 className="text-2xl font-bold leading-none text-slate-900 max-md:max-w-full">
        সংক্ষিপ্ত বিবরণ
      </h2>
      <p className="mt-4 text-base font-medium leading-6 text-slate-600 max-md:max-w-full">
        কোল্ড ইমেল আউটরিচ হল একটি ইমেল মার্কেটিং পদ্ধতি যা অতিথি পোস্টিং অনুরোধ,
        কন্টেন্ট মার্কেটিং, অথবা পরিষেবা প্রচারের জন্য ব্যবহৃত হয়। অর্থাৎ, আপনি
        ইমেল মালিককে এমনভাবে ইমেল করছেন যাতে ইমেল মালিক বুঝতে না পারেন যে আপনি
        তাকে কিছু প্রচার করেছেন।
        <br />
        <br />
        কোল্ড ইমেল আউটরিচ কী, কেন এটি প্রয়োজন এবং এটি কীভাবে কাজ করে তার
        বিস্তারিত তথ্য আমি আমার গবেষণা এবং অভিজ্ঞতা থেকে শেয়ার করেছি, যদি আপনি
        কোনও অংশ বুঝতে না পারেন, তাহলে একটি মন্তব্য বাক্স আছে।
        <br />
        <br />
        আমি গুগল, ইউটিউব অনুসন্ধান করে এবং পরীক্ষা-নিরীক্ষা করে বেশিরভাগ সরঞ্জাম
        এবং বিষয় শিখেছি। তাই যদি আপনার আরও ভাল কোনও পদ্ধতি বা সরঞ্জাম জানা
        থাকে, তাহলে দয়া করে মন্তব্য বাক্সে আমাকে জানান।
      </p>
    </article>
  );
};
