import React from "react";
import CertificationSectionTitle from "./certification-section-title";

const CertificationHowItWorks = () => {
  const steps = [
    {
      icon: (
        <svg width={20} height={20} viewBox="0 0 20 20" fill="none">
          <path
            d="M16.6666 12.5C16.6666 14.0532 16.6666 14.8297 16.4129 15.4423C16.0746 16.259 15.4256 16.9079 14.6089 17.2462C13.9963 17.5 13.2197 17.5 11.6666 17.5H9.16663C6.02395 17.5 4.45258 17.5 3.47628 16.5237C2.49996 15.5473 2.49998 13.976 2.5 10.8332L2.50005 5.83319C2.50007 3.99232 3.9924 2.5 5.83328 2.5"
            stroke="#41504F"
            strokeWidth="1.5"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
          <path
            d="M8.33395 7.08331L8.69537 10.3907C8.72987 10.6672 8.89978 10.9082 9.15578 11.0182C9.72745 11.2637 10.7981 11.6666 11.6673 11.6666C12.5365 11.6666 13.6072 11.2637 14.1789 11.0182C14.4349 10.9082 14.6048 10.6672 14.6393 10.3907L15.0006 7.08331M17.084 6.24998V9.39098M11.6673 3.33331L5.83398 5.83331L11.6673 8.33331L17.5006 5.83331L11.6673 3.33331Z"
            stroke="#41504F"
            strokeWidth="1.5"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
        </svg>
      ),
      title: "কোর্স করুন",
      description: "আপনার নিজস্ব গতিতে কঠোর কোর্সের একটি সিরিজ সম্পূর্ণ করুন।",
    },
    {
      icon: (
        <svg width={21} height={20} viewBox="0 0 21 20" fill="none">
          <path
            d="M16.9996 12.5C16.9996 14.0532 16.9996 14.8297 16.7459 15.4423C16.4076 16.259 15.7586 16.9079 14.9419 17.2462C14.3293 17.5 13.5527 17.5 11.9996 17.5H9.49964C6.35696 17.5 4.78559 17.5 3.80928 16.5237C2.83297 15.5473 2.83298 13.976 2.83301 10.8332L2.83306 5.83319C2.83307 3.99232 4.32541 2.5 6.16628 2.5"
            stroke="#41504F"
            strokeWidth="1.5"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
          <path
            d="M8.66696 7.08331L9.02838 10.3907C9.06288 10.6672 9.23279 10.9082 9.48879 11.0182C10.0605 11.2637 11.1311 11.6666 12.0003 11.6666C12.8695 11.6666 13.9402 11.2637 14.5119 11.0182C14.7679 10.9082 14.9378 10.6672 14.9723 10.3907L15.3336 7.08331M17.417 6.24998V9.39098M12.0003 3.33331L6.16699 5.83331L12.0003 8.33331L17.8336 5.83331L12.0003 3.33331Z"
            stroke="#41504F"
            strokeWidth="1.5"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
        </svg>
      ),
      title: "হাতে-কলমে প্রকল্প",
      description:
        "বাস্তব-বিশ্বের প্রকল্পগুলিতে আপনার দক্ষতা প্রয়োগ করুন এবং একটি পোর্টফোলিও তৈরি করুন।",
    },
    {
      icon: (
        <svg width={21} height={20} viewBox="0 0 21 20" fill="none">
          <path
            d="M10.2503 18.3334C6.91121 18.3334 5.24165 18.3334 4.20433 17.1129C3.16699 15.8926 3.16699 13.9284 3.16699 10C3.16699 6.07165 3.16699 4.10746 4.20433 2.88708C5.24165 1.66669 6.91121 1.66669 10.2503 1.66669C13.5894 1.66669 15.259 1.66669 16.2963 2.88708C17.1313 3.86945 17.2942 5.3338 17.326 7.91669"
            stroke="#41504F"
            strokeWidth="1.5"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
          <path
            d="M7.33301 6.66669H13.1663M7.33301 10.8334H9.83301"
            stroke="#41504F"
            strokeWidth="1.5"
            strokeLinecap="round"
            strokeLinejoin="round"
          />
          <path
            d="M17.0073 15.0878C17.7098 14.5765 18.1663 13.7478 18.1663 12.8125C18.1663 11.2592 16.9072 10 15.3538 10H15.1455C13.5922 10 12.333 11.2592 12.333 12.8125C12.333 13.7478 12.7896 14.5765 13.492 15.0878M17.0073 15.0878C16.5433 15.4257 15.9718 15.625 15.3538 15.625H15.1455C14.5275 15.625 13.9561 15.4257 13.492 15.0878M17.0073 15.0878L17.493 16.617C17.6783 17.2002 17.7709 17.4919 17.7456 17.6735C17.6928 18.0514 17.3846 18.332 17.0207 18.3333C16.8458 18.334 16.5838 18.1965 16.0599 17.9216C15.8353 17.8037 15.7229 17.7447 15.608 17.71C15.3738 17.6394 15.1255 17.6394 14.8913 17.71C14.7764 17.7447 14.6641 17.8037 14.4394 17.9216C13.9155 18.1965 13.6535 18.334 13.4787 18.3333C13.1148 18.332 12.8065 18.0514 12.7538 17.6735C12.7284 17.4919 12.8211 17.2002 13.0063 16.617L13.492 15.0878"
            stroke="#41504F"
            strokeWidth="1.5"
          />
        </svg>
      ),
      title: "সার্টিফিকেট অর্জন করুন",
      description:
        "নিয়োগকর্তাদের কাছে আপনার দক্ষতা প্রদর্শন করুন এবং আপনার ক্যারিয়ারকে এগিয়ে নিন।",
    },
  ];

  return (
    <div className="max-w-4xl">
      <div className="flex flex-col gap-4">
        <CertificationSectionTitle title=" পেশাদার সার্টিফিকেট কীভাবে কাজ করে" />

        <div className="grid md:grid-cols-3 grid-cols-1 gap-4">
          {steps.map((step, index) => (
            <div
              key={index}
              className="flex flex-col flex-grow gap-4 px-4 pt-4 pb-[18px] rounded-lg bg-white border-[1.2px] border-[#dfedeb] shadow-[0px_4px_4px_0_rgba(2,22,20,0.02)]"
            >
              <div className="flex items-center gap-2.5 p-2.5 rounded-[10px] border-[1.2px] border-[#dfedeb] w-fit">
                {step.icon}
              </div>
              <div className="flex flex-col gap-1.5">
                <h3 className="text-lg font-semibold text-[#021614]">
                  {step.title}
                </h3>
                <p className="text-sm text-[#41504f]">{step.description}</p>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default CertificationHowItWorks;
