import { SocialLinks } from "./SocialLinks";
import { CategoryBadges } from "./CategoryBadges";
import { PolicySection } from "./PolicySection";
import { AuthorInfo } from "./AuthorInfo";

export function BlogContent() {

  
  return (
    <div className="">
      <AuthorInfo
        name="এমদাদ হোসাইন"
        date="20 জানুয়ারী 2024"
        avatarUrl="/images/teacher/user1.png"
      />
      <div className="mt-12 w-full  max-md:mt-10 max-md:max-w-full">
        <img
          loading="lazy"
          src="/images/blog/blogcover.svg"
          alt="UX Review Presentation"
          className="object-contain w-full aspect-[2.11] max-md:max-w-full"
        />
      </div>

      <div className="flex justify-center mt-20">
        <article className="rounded-lg max-w-[660px] ">
          <header className="w-full text-base font-medium leading-7 text-slate-600 max-md:max-w-full">
            <p>১২ এপ্রিল, ২০২৪ থেকে কার্যকর</p>
            <p>
              সৃজনশীলদের জন্য বিশ্বের বৃহত্তম অনলাইন লার্নিং কমিউনিটি,
              স্কিলশেয়ারে স্বাগতম। প্রায়োগিক, ইনকর্পোরেটেড, একটি ডেলাওয়্যার
              কর্পোরেশন, আমাদের সহায়ক এবং সহযোগী সংস্থাগুলির সাথে, যার মধ্যে
              রয়েছে এর অপারেটিং ব্র্যান্ড, সুপারপিয়ার, ("প্রায়োগিক", "আমরা",
              "আমাদের" বা "আমাদের") আপনার গোপনীয়তাকে সম্মান করে এবং আমরা আপনার
              ব্যক্তিগত তথ্য সম্পর্কে যত্নশীল, তাই আমরা কীভাবে এটি সংগ্রহ,
              ব্যবহার এবং ভাগ করি তা ব্যাখ্যা করার জন্য আমরা এই গোপনীয়তা নীতি
              প্রস্তুত করেছি।
            </p>
            <p>
              আমাদের ক্যালিফোর্নিয়া কনজিউমার প্রাইভেসি অ্যাক্ট (CCPA) গোপনীয়তা
              বিজ্ঞপ্তি, কলোরাডো, কানেকটিকাট, ওরেগন, মন্টানা, টেক্সাস,
              ভার্জিনিয়া এবং উটাহের বাসিন্দাদের জন্য আমাদের গোপনীয়তা
              বিজ্ঞপ্তি, নেভাদার বাসিন্দাদের জন্য আমাদের গোপনীয়তা বিজ্ঞপ্তি,
              অথবা আমাদের কুকি বিজ্ঞপ্তি দেখতে, অনুগ্রহ করে লিঙ্কগুলিতে ক্লিক
              করুন অথবা কেবল নীচে স্ক্রোল করুন।
            </p>
          </header>

          <PolicySection
            title="অন্যান্য সম্পদ"
            content={`যখন আপনি আমাদের সাথে নিবন্ধন করেন, যখন আপনি একজন Skillshare সদস্য হন অথবা Skillshare-এর মালিকানাধীন বা পরিচালিত কোনও প্ল্যাটফর্মের সদস্য হন, যখন আপনি কোনও ক্লাস বা ইভেন্ট (আমাদের পরিষেবার শর্তাবলীতে সংজ্ঞায়িত) পড়ান, যোগদান করেন বা হোস্ট করেন, যখন আপনি Skillshare বা Skillshare-এর মালিকানাধীন বা পরিচালিত কোনও প্ল্যাটফর্মে বিক্রয়ের জন্য সামগ্রী বা পরিষেবা অফার করেন, অথবা যখন আপনি Skillshare-এর স্পন্সর করা ওয়েবপৃষ্ঠাগুলির সাথে জড়িত হন, যার মধ্যে জরিপ বা কুইজ অন্তর্ভুক্ত থাকে, তখন আমরা আপনার কাছে ব্যক্তিগত তথ্য চাইতে পারি। ব্যক্তিগত তথ্য  বলতে এমন তথ্য বোঝায় যা কোনও নির্দিষ্ট গ্রাহক বা পরিবারের সাথে প্রত্যক্ষ বা পরোক্ষভাবে সনাক্ত করে, সম্পর্কিত করে, বর্ণনা করে, যুক্ত হতে পারে, যুক্তিসঙ্গতভাবে যুক্ত হতে পারে। এছাড়াও, আমরা এমন তথ্য সংগ্রহ করতে পারি যা আপনার কাছে শনাক্তযোগ্য নয় বা আপনার সাথে অন্যথায় সম্পর্কিত, যেমন সমষ্টিগত ডেটা। এটি ব্যক্তিগত তথ্য নয়। এই ডেটা যতদূর সংরক্ষণ করা হয় বা ব্যক্তিগত ডেটার সাথে যুক্ত করা হয়, ততদূর এটি ব্যক্তিগত তথ্য হিসাবে বিবেচিত হবে; অন্যথায়, তথ্য এই গোপনীয়তা নীতির আওতাধীন নয়।

এই সারণীগুলিতে আমরা যে ব্যক্তিগত তথ্য সংগ্রহ করি এবং ব্যবহার করি তার বিভাগগুলি নির্ধারণ করা হয়েছে।`}
          />

          <PolicySection
            title="অন্যান্য সম্পদ"
            content={`যখন আপনি আমাদের সাথে নিবন্ধন করেন, যখন আপনি একজন Skillshare সদস্য হন অথবা Skillshare-এর মালিকানাধীন বা পরিচালিত কোনও প্ল্যাটফর্মের সদস্য হন, যখন আপনি কোনও ক্লাস বা ইভেন্ট (আমাদের পরিষেবার শর্তাবলীতে সংজ্ঞায়িত) পড়ান, যোগদান করেন বা হোস্ট করেন, যখন আপনি Skillshare বা Skillshare-এর মালিকানাধীন বা পরিচালিত কোনও প্ল্যাটফর্মে বিক্রয়ের জন্য সামগ্রী বা পরিষেবা অফার করেন, অথবা যখন আপনি Skillshare-এর স্পন্সর করা ওয়েবপৃষ্ঠাগুলির সাথে জড়িত হন, যার মধ্যে জরিপ বা কুইজ অন্তর্ভুক্ত থাকে, তখন আমরা আপনার কাছে ব্যক্তিগত তথ্য চাইতে পারি। ব্যক্তিগত তথ্য  বলতে এমন তথ্য বোঝায় যা কোনও নির্দিষ্ট গ্রাহক বা পরিবারের সাথে প্রত্যক্ষ বা পরোক্ষভাবে সনাক্ত করে, সম্পর্কিত করে, বর্ণনা করে, যুক্ত হতে পারে, যুক্তিসঙ্গতভাবে যুক্ত হতে পারে। এছাড়াও, আমরা এমন তথ্য সংগ্রহ করতে পারি যা আপনার কাছে শনাক্তযোগ্য নয় বা আপনার সাথে অন্যথায় সম্পর্কিত, যেমন সমষ্টিগত ডেটা। এটি ব্যক্তিগত তথ্য নয়। এই ডেটা যতদূর সংরক্ষণ করা হয় বা ব্যক্তিগত ডেটার সাথে যুক্ত করা হয়, ততদূর এটি ব্যক্তিগত তথ্য হিসাবে বিবেচিত হবে; অন্যথায়, তথ্য এই গোপনীয়তা নীতির আওতাধীন নয়।

এই সারণীগুলিতে আমরা যে ব্যক্তিগত তথ্য সংগ্রহ করি এবং ব্যবহার করি তার বিভাগগুলি নির্ধারণ করা হয়েছে।`}
          />

          <footer className="flex flex-wrap gap-6 justify-between items-center pt-6 mt-10 w-full border-t border-gray-200 max-md:max-w-full">
            <CategoryBadges />
            <SocialLinks />

        
          </footer>
        </article>
      </div>
    </div>
  );
}