// import { homeTestimonials } from "@/data/testimonials-data";
import SuccessStoryGrid from "./SuccessStoryGrid";

const SuccessStory = () => {
  const bgColors = ["bg-[#F8F3E9]", "bg-[#E9F8F2]", "bg-[#EEF8E9]"];
  const homeTestimonials = [
    {
      id: 1,
      title: "",
      name: "মোঃ ওলি উল্লাহ মির্ধা",
      avatar: "/reviews/facebook/mridha.webp",
      text: "বাংলাদেশের অনলাইন লার্নিং প্ল্যাটফর্মগুলোর মধ্যে আপনাদের কোর্সগুলো সত্যিই আলাদা। সাজানো-গোছানো ছোট ছোট ভিডিওতে শেখা অনেক সহজ হয়েছে। যদি প্র্যাকটিক্যাল অ্যাসাইনমেন্ট আর এমসিকিউ যুক্ত হয়, তাহলে শিক্ষার্থীরা আরও দক্ষ হয়ে উঠবে। আমি নির্দ্বিধায় অন্যদেরও এই প্ল্যাটফর্ম রেকমেন্ড করব।",
      bgColor: "bg-[#F8F3E9]",
    },
    {
      id: 2,
      title: "",
      name: "মোঃ কামরুল হাসান",
      avatar: "/reviews/kamrul.webp",
      text: "প্রায়োগিক প্লাটফর্ম হচ্ছে আমার অনলাইন ট্রেনিং গুরু কোর্সটি আমার প্রত্যাশার থেকেও বেশি মূল্য দিয়েছে। কোর্সের বিষয়বস্তু খুবই প্রাসঙ্গিক ও বাস্তবমুখী। বাস্তব উদাহরণের মাধ্যমে কৌশল শেখানো হয়েছে, যা আমার পেশাগত দক্ষতা উন্নত করতে দারুণ সহায়ক হয়েছে। যদি কারো কিছু শেখার আগ্রহ থাকে নিঃসন্দেহে এই প্লাটফর্ম থেকে শিখতে পারেন যা আপনার স্কিল ডেভলপমেন্ট করতে সাহায্য করবে। সর্বপরি এটা বলতে পারি প্রায়োগিক হচ্ছে দেশ সেরা অনলাইন আইটি ট্রেনিং প্লাটফর্ম।",
      bgColor: bgColors[1],
    },
    {
      id: 3,
      title: "",
      name: "ইমায়েদ আহসান",
      avatar: "/reviews/imayad.webp",
      text: "প্রায়োগিক প্ল্যাটফর্মের উদ্যোগ নিয়ে আমার অভিজ্ঞতা লেখা শুরু করার আগে একটা বিষয় না বললেই নয়, প্রায়োগিক প্ল্যাটফর্মের ভিডিও ও অডিও কোয়ালিটি সত্যিই অসাধারণ। এত নিখুঁত কোয়ালিটি আমি দেশের অন্য কোনো ই-লার্নিং প্ল্যাটফর্মে দেখেছি বলে মনে পড়ে না। শুধু তাই নয়, একেবারে ডিজিটাল মার্কেটিংকে টার্গেট করে এমন একটি পূর্ণাঙ্গ ই-প্ল্যাটফর্ম তৈরি, এটি নিঃসন্দেহে বিশেষভাবে প্রশংসার দাবিদার। এখন আসি মূল বিষয়ে। প্রায়োগিক প্ল্যাটফর্মের সবচেয়ে ভালো দিক হলো, এখানে প্রতিটি টপিক খুব ছোট ছোট সাবজেক্ট ধরে গভীরভাবে আলোচনা করা হয়েছে। অপ্রয়োজনীয় কথায় সময় নষ্ট না করে একদম টু দ্যা পয়েন্ট শেখানো হয়েছে, আর তার সাথে প্র্যাকটিক্যাল ডেমো দেখানো হয়েছে, যেটা আমার কাছে সবচেয়ে উপভোগ্য লেগেছে। এখানে ছোট-বড় সব ধরনের কোর্স রয়েছে। কিছু কিছু নিশ টপিকের কোর্স বাংলাদেশে এই প্রথম তৈরি হয়েছে প্রায়োগিকে, যা সত্যিই দারুণ একটি উদ্যোগ। প্রতিটি কোর্সই অভিজ্ঞ মেন্টররা অনেক যত্ন নিয়ে তৈরি করেছেন। প্ল্যাটফর্মটির UI/UX ডিজাইনও ব্যবহারবান্ধব, ফলে শেখার সময় একটুও জটিল মনে হয়নি।কোর্সগুলোর মান এক কথায় অসাধারণ। ইন্সট্রাক্টররা সহজ ভাষায় বিষয়গুলো উপস্থাপন করেছেন, ফলে জটিল বিষয়ও খুব সহজে বোঝা গেছে। শেখার অভিজ্ঞতা আমার জন্য ছিল আনন্দদায়ক, আর সবচেয়ে বড় কথা, আমি সত্যিই মনে করেছি আমি নতুন কিছু শিখে বাস্তবে কাজে লাগাতে পারছি। সবশেষে আমি বলব—হ্যাঁ, আমি অবশ্যই প্রায়োগিক প্ল্যাটফর্ম অন্যদের রেকমেন্ড করব। যারা শুধু তাত্ত্বিক জ্ঞানে সীমাবদ্ধ না থেকে সত্যিকারের স্কিল ডেভেলপ করতে চান, তাদের জন্য এই প্ল্যাটফর্ম নিঃসন্দেহে একটি সেরা সমাধান। আমার কিছু সাজেশন: - ওয়েবসাইটটিকে আরও দ্রুত (fast) করার দিকে নজর দেওয়া যেতে পারে। - নতুন কোনো কোর্স বা মডিউল যুক্ত হলে যেন নিয়মিত নোটিফিকেশন পাওয়া যায়। - কোর্সগুলোকে ক্যাটাগরি অনুযায়ী ফোল্ডারে সাজানো যেতে পারে। যেমন: সব ফেসবুক কোর্স এক ফোল্ডারে, এসইও কোর্স আরেক ফোল্ডারে। - কোর্স শেষ করার জন্য ব্যবহারকারীদের নিয়মিত রিমাইন্ডার বা তাগিদমূলক নোটিফিকেশন দেওয়া যেতে পারে।- প্ল্যাটফর্মটিকে যত বেশি ইন্টারঅ্যাকটিভ করা সম্ভব, সেটি শেখার অভিজ্ঞতাকে আরও সমৃদ্ধ করবে।",
      bgColor: bgColors[2],
    },
    {
      id: 4,
      title: "",
      name: "রুদ্রনীল সৌরভ",
      avatar: "/reviews/rudroneel.png",
      text: "প্রায়োগিকের কোর্সে প্র্যাকটিক্যাল লার্নিং ও ভ্যালু প্রায়োগিকের এই উদ্যোগ সত্যিই প্রশংসনীয়। এখানে বহুমুখী লার্নিং এর ব্যবস্থা থাকার কারণে শিক্ষার্থীরা বাস্তব কাজ শেখার আত্মবিশ্বাস অর্জন করতে পারবে বলে আমি মনে করি । কোর্সগুলো বিগিনার ফ্রেন্ডলি থেকে শুরু করে অ্যাডভান্সড লেভেল পর্যন্ত আপডেটেড কনটেন্টে ভরপুর। আমি নিজে এখান থেকে ভ্যালু পেয়েছি এবং আত্মবিশ্বাসের সঙ্গে বলতে পারি—আমি নির্দ্বিধায় প্রায়োগিকের কোর্সগুলো অন্যদের রিকমেন্ড করব।",
      bgColor: bgColors[2],
    },
    {
      id: 5,
      title: "",
      name: "ইফতেখার আলম",
      avatar: "/reviews/iftekhar.webp",
      text: "প্রফেশনাল ডিজিটাল মার্কেটারদের জন্য এটি ভালো একটি উদ্যোগ প্রফেশনাল ডিজিটাল মার্কেটারদের জন্য এটি ভালো একটি উদ্যোগ। আশা করছি গতানুগতিক কোর্সগুলোর মত হবেনা। আমি সাধারন্ত ছোট কোর্সের ধারণাটি পছন্দ করি, কারণ দীর্ঘ কোর্সগুলিতে মনোযোগ দেওয়া খুব কঠিন। সাইটের UX আরো ইউজার ফ্রেন্ডলি হবে আশা করছি। বিশেষ করে কোর্স ভিডিও চলাকালীন ইন্টারফেস আরেকটু ইউজার ফ্রেন্ডলি হলে ভালো হত। তবে সামগ্রিক অভিজ্ঞতার কথা বললে আমি স্যাটিস্ফাইড।",
      bgColor: bgColors[0],
    },
    {
      id: 6,
      title: "",
      name: "ফেরদৌসী অ্যানি",
      avatar: "/reviews/anny.webp",
      text: "অনেক নতুন বিষয়ে শেখার এক দারুণ অভিজ্ঞতা প্রায়োগিকের কোর্সগুলোর মাধ্যমে এখানে অনেকগুলো কোর্স আমার জন্য একদমই নতুন ছিল। শুদ্ধ উচ্চারণে এমন বাংলায় কোর্স আমি আগে দেখি নাই। প্রায় সব কোর্স এই A to Z দেখানো হয়েছে তবে কয়েকটি কোর্স এ আরো ডিটেইলস এড করা যেতো। কোর্সগুলো বেশ এডভান্স লেভেলের, প্রাইম কোর্সগুলো যদি ব্যাসিক থেকে শুরু হয় তবে এই কোর্সগুলো বুঝতে পারা সহজ হবে। এখানে অনেক কোর্স আছে যেগুলো আমরা সচরাচর যে ডিজিটাল মার্কেটিং কোর্সগুলো দেখি তার থেকে বেশি টপিক, বলা যায় ওভারঅল টপিক কভার করার চেষ্টা মনে হয়েছে। কয়েকটি ভিডিওর সাউন্ড একটু লো ছিলো। আর ইউটিউবের মতো ভিডিওগুলো থিয়েটার মুডে দেখতে পারলে ভালো হতো। যাদের শেখার অনেক আগ্রহ আমি অবশ্যই তাদের প্রায়োগিক এর এই কোর্সগুলো রিকমেন্ড করবো কেননা এখানে ট্রেডিশনাল SEO এর বাইরে শেখানো হয়েছে। অটোমেশন সম্পর্কে খুব ভাল একটা অভিজ্ঞতা হয়েছে। কোর্সগুলোর সাথে এটাচমেন্ট থাকবে যেগুলো মেম্বাররা পাবেন। ডিজিটাল মার্কেটিং ছাড়াও এখানে ওয়েব ডেভেলপমেন্ট, UI/UX ডিজাইন, অ্যানিমেশন, ভিডিও এডিটিং এর কোর্স রয়েছে।",
      bgColor: bgColors[1],
    },
    {
      id: 7,
      title: "",
      name: "উমর ফারুক",
      avatar: "/reviews/omarfaruk.webp",
      text: "প্রায়োগিকের বহুমুখী কোর্সে অংশগ্রহণ আমার জন্য জ্ঞান ও দক্ষতা বৃদ্ধির এক অসাধারণ অভিজ্ঞতা ছিল প্রায়োগিকের এই উদ্যোগ নিঃসন্দেহে প্রশংসনীয়। আমি মনে করি এই প্লাটফর্মের মাধ্যমে শিক্ষার্থীরা অনেক উপকৃত হবে। আমি শর্ট কোর্স থেকে আমি বাস্তব অর্থেই অনেক জ্ঞান অর্জন করেছি। তাই আমি প্রোয়োগিকের এই প্লাটফর্মের কোর্সগুলো আমি নিরদ্বিধায় রেকোমেন্ড করছি।",
      bgColor: bgColors[0],
    },
    {
      id: 8,
      title: "",
      name: "কাজী মাহমুদুল হাসান",
      avatar: "/reviews/kazi.webp",
      text: "Prayogik: শেখার অসাধারণ অভিজ্ঞতা আমি Prayogik-এ অসাধারণ একটি অভিজ্ঞতা পেয়েছি। যা আর কোনও বাংলা প্ল্যাটফর্ম এ পাইনি। এখানে নানা রকম বিষয় শেখার সুযোগ আছে যেগুলো যুগোপযুগী আর কিছু ছোট কোর্স আছে যেগুলো খুবই কাজে লাগে। Prayogik থেকে আমার প্রত্যাশার চেয়েও বেশি শিখেছি। সবাইকে সাজেস্ট করব!",
      bgColor: bgColors[1],
    },
    {
      id: 9,
      title: "",
      name: "নজরুল ইসলাম",
      avatar: "/reviews/nazrul.webp",
      text: "প্রায়োগিকের কোর্সে আমার সেরা অভিজ্ঞতা। ডিজিটাল মার্কেটার ও অনলাইন বিজনেস এর জন্য এই প্লাটফর্ম অনেক কার্যকর। টপিক গুলো সংক্ষিপ্ত ও প্রাকটিক্যাল হয়াতে শেখা সহজ এবং আরও কার্যকর হবে লার্নারদের জন্য। ভিডিও ও অডিও কোয়ালিটি অনেক ভালো। নতুন কিছু শেখার জন্য অনেক উপকারী । ডিজিটাল মার্কেটিং শেখার জন্য অনেক দারুন প্লাটফর্ম । শিক্ষার্থীরা নতুন কিছু বাস্তবে কাজে লাগানোর সেরা প্লাটফর্ম, ইনশাল্লাহ ।",
      bgColor: bgColors[2],
    },
    {
      id: 10,
      title: "",
      name: "আতিকুর রহমান",
      avatar: "/reviews/default.png",
      text: "প্রায়োগীক এর ব্যাপারে একটাই কথা প্রায়োগীক এর ব্যাপারে একটাই কথা, এখানে যারা শেখায় তারা স্ব বিষয়ে অভিজ্ঞ । তাই প্রায়োগীক বিশ্বাস করি । এগিয়ে যাক প্রায়োগীক ।",
      bgColor: bgColors[2],
    },
    {
      id: 11,
      title: "",
      name: "খালিদ হোসেন",
      avatar: "/reviews/khalid.webp",
      text: "প্রায়োগিকের বাস্তবভিত্তিক কোর্স সত্যিই প্রশংসনীয় প্রায়োগিক প্ল্যাটফর্মের উদ্যোগ সত্যিই শিক্ষার্থীদের জন্য আশার আলো। এখানে বইমুখী পড়াশোনার চেয়ে বাস্তব জ্ঞান অর্জনের সুযোগ বেশি। কোর্সগুলোতে হ্যান্ডস-অন প্রজেক্ট ও ব্যবহারিক উদাহরণ রয়েছে, যা শেখাকে আরও সহজ করে তোলে। আমি ব্যক্তিগতভাবে তাদের কোর্সগুলোতে সন্তুষ্ট এবং আগ্রহী সবাইকে চেষ্টা করার পরামর্শ দিচ্ছি।",
      bgColor: bgColors[0],
    },
    {
      id: 12,
      title: "",
      name: "শফিকুল ইসলাম",
      avatar: "/reviews/shafikul.webp",
      text: "আমি “Prayogik” প্ল্যাটফর্ম থেকে কয়েকটি কোর্স করেছি এবং শেখার অভিজ্ঞতাটা বেশ ভালো লেগেছে। কোর্সগুলো ছোট ছোট মডিউলে সাজানো, তাই সময় কম লাগলেও সহজে বোঝা যায়। কনটেন্টগুলো খুব বেশি জটিল নয়, তবে পরিষ্কারভাবে ব্যাখ্যা করা হয়েছে এবং বাস্তব উদাহরণও ছিল। এতে বিষয়গুলো বুঝতে সুবিধা হয়েছে। আমার মনে হয়েছে, যদি কিছু কোর্সে রিয়েল প্রজেক্ট-ভিত্তিক অ্যাসাইনমেন্ট থাকত, তাহলে আরও ভালো হতো। সব মিলিয়ে, যারা নতুন স্কিল শিখতে চান তাদের জন্য এটি একটি কার্যকর প্ল্যাটফর্ম। আমার অভিজ্ঞতা ইতিবাচক ছিল এবং আমি অন্যদেরও এটি ব্যবহার করতে বলব",

      bgColor: bgColors[1],
    },
  ];
  return (
    <section className="bg-white">
      <div className="px-6 md:px-8 lg:px-8 xl:px-8 2xl:px-0 pb-24 max-w-7xl mx-auto ">
        <SuccessStoryGrid testimonials={homeTestimonials} />
      </div>
    </section>
  );
};

export default SuccessStory;
