import SuccessStoryClient from "./SuccessStoryClient";
const SuccessStory = () => {

  const bgColors = ["bg-[#F8F3E9]", "bg-[#E9F8F2]", "bg-[#EEF8E9]"];

  // const testimonials = [
  //   {
  //     id: 1,
  //     title: "",
  //     name: "Khan Miraj",
  //     avatar: "/reviews/khan-miraj.jpg",
  //     text:
  //       "অবশ্যই রিকোমেন্ড করবো। এখানে কোর্স করার পর যতটুকু বুঝলাম এই কোর্স করতে হলেও একটা যোগ্যতা দরকার। একবার দেখা শেষ করেছি আবার করবো নোট করে করে। এমন ভিডিও আসে ১০ বারের উপরে দেখেছি বুঝার জন্য সেগুলো নিয়ে প্রচুর রিসার্চ করতে হবে। কেউ যদি মনে করে এখানে মুখে তুলে খাওয়ায় দিবে এরকম কোর্স এটা না যে ভিডিও দেখলেন আর হয়ে গেলো। সামনের মাসে লিংকেবল কন্টেন্ট রিসার্চ করে প্রেক্টিকাল স্কাইস্ক্রেপার মেথডে কাজ করার চেষ্টা করবো প্রথম লিঙ্কবিল্ডিং। চেষ্টা করবো সেই রেজাল্ট ও আপনাদের সাথে শেয়ার করার।",
  //     bgColor: bgColors[0]
  //   },
  //   {
  //     id: 2,
  //     title: "",
  //     name: "Rasel Ahmed Raju",
  //     avatar: "/reviews/rasel-ahmed-raju.jpg",
  //     text: "এসইওর অনেক টিউটোরিয়াল দেখেছি। নানা রকমের টোটকা পদ্ধতি দেখেছি। কিন্তু প্রায়গিকের কোর্স করে মনে হচ্ছে আসলেই একটি জিনিস শিখলাম যা সারাজীবন কাজে লাগবে। যেখানেই চাকুরী বা ব্যাবসা করি এর প্রভাব আমার সব কাজেই পড়বে। পুরা ফ্যাটলেস টিউটোরিয়াল। কোন অপ্রয়োজনীয় কথা নেই। ভিডিও গুলো ছোট ছোট কিন্তু ভ্যালু ছিল অনেক বেশি। ব্রেইনস্ট্রমিং অটোম্যাটিক শুরু হয়ে যায়। এটা বুঝলাম ভ্যালুয়েবল কন্টেন্ট প্রডিউস করে প্রপারলি আউটরিচ করে লিংক পাওয়া সহজ। এবং সেটা প্রচুর সংখ্যক।",
  //     bgColor: bgColors[1]
  //   },
  //   {
  //     id: 3,
  //     title: "",
  //     name: "Kazi Noor",
  //     avatar: "/reviews/kazi-noor.jpg",
  //     text: "সবে মাত্র ভিডিও গুলো দেখা শেষ করেছি। তাতেই বুঝতে পারলাম যে আবারো অনেক বার দেখতে হবে ভিডিও গুলো এবং যে নিখুত ব্যাপার গুলো সহজ ভাবে বোঝানো হয়েছে সেই মোতাবেক কাজ করে যেতে হবে। নিঃসন্দেহে এই কোর্স আপনাকে প্রচলিত লিঙ্ক বিল্ডিং এর সব ধারনা থেকে বের করে নিয়ে আসবে বলে আমার বিশ্বাস। যারা ওয়ার্ল্ড ক্লাস লিঙ্ক বিল্ডিং এক্সপার্ট হতে চায়, তাদের কে আমি এই কোর্স টি অবশ্যই রেকমেন্ড করবো। কারন এতে মার্কেটপ্লেস, ক্যারিয়ার সেটআপ, কিভাবে সার্ভিস সেল করবেন এবং আরও নানান বিষয়ে লেসন দেয়া আছে। সুতরাং এটি নিঃসন্দেহে আপনার জন্য একটি উত্তম কোর্স হবে যদি আপনি একজন ভাল মানের লিঙ্ক বিল্ডিং এক্সপার্ট হতে চান।",
  //     bgColor: bgColors[2]
  //   },
  //   {
  //     id: 4,
  //     title: "",
  //     name: "মোঃ আল শাহরিয়ার",
  //     avatar: "/reviews/md-al-shahriyar.jpg",
  //     text: "প্রায়োগিক লিংক বিল্ডিং কোর্সটা এনরোল করার পরেঃনিউবি হিসেবে লিংক বিল্ডিং নিয়ে আমার অনেক কনফিউশন এবং ভয় কাজ করতো।এই বিষয়ে, অনলাইনে খুজেও খুব বেশি রিসোর্স পাইনি, পেলেও বিক্ষিপ্ত আকারে ছিলো। যা দিয়ে খুব একটা আগাতে পারিনি।এক্ষেত্রে, আমাদের দেশে লিংক বিল্ডিং নিয়ে এর আগে এমন গুছানো,ক্লিয়ার কোন কোর্স বা গাইড লাইন পাইনি। এই কোর্সটিতে সবকিছু একটি প্লাটফর্মে পেয়েছি।এই কোর্সটিতে লিংক বিল্ডিং এ ক্যারিয়ার সেট আপ করার ক্ষেত্রেও বিস্তারিত দিকনির্দেশনা দেয়া আছে।সবমিলিয়ে, কোর্সটি খুবই ভালো লেগেছে আমার কাছে।",
  //     bgColor: bgColors[0]
  //   },
  //   {
  //     id: 5,
  //     title: "",
  //     name: "Debashis Baidya",
  //     avatar: "/reviews/debashis-baidya.jpg",
  //     text: "প্রথমেই আবুল কাসেম স্যার কে ধন্যবাদ এইরকম একটা কোর্সে আমাদের সুযোগ করে দেওয়ার জন্য। যারা ডিজিটাল মার্কেটিং ফিল্ড এ কাজ করেন, তাদের সবার ই এই কোর্স করা উচিত। লিঙ্ক বিল্ডিং এর অ্যাডভান্স শিখতে হলে এর বিকল্প নেই। এক একটি বিষয় এতো নিখুঁত করে দেখানো আছে যে বার বার ভিডিও গুলি দেখেও সব শেখা হয়ে উঠছে না। এই কোর্স টি প্র্যাকটিস করলেই 6 মাস চলে যাবে বলে আমার ধারণা, সঙ্গে এখন কিভাবে লিঙ্ক বিল্ডিং হচ্ছে তার স্পষ্ট গাইড আছে। আমি শেষ চার বছর ধরে SEO মার্কেটের সঙ্গে যুক্ত, আমার ধারণা বাঙলা ভাষায় এইরকম কোর্স এখনো পর্যন্ত কেউ ই বানাতে পারে নি। সমস্ত অ্যাডভান্স লিংক বিল্ডিং টেকনিক যেমন গেস্ট পোস্ট, স্কাইস্ক্র্যাপের টেকনিক, লিঙ্ক এবলে কনটেন্ট ক্রিটেশন, আউটরীচ ইত্যাদি খুব ই স্পষ্ট ভাবে দেখানো হয়েছে। প্রচলিত লিঙ্ক বিল্ডিং এর ধারণা বদলে যাবে এই কোর্স করলে, তাই কোর্স টি অবশ্যই রেকমেন্ড করবো।",
  //     bgColor: bgColors[1]
  //   },
  //   {
  //     id: 6,
  //     title: "",
  //     name: "এম এস এইচ চৌধুরী",
  //     avatar: "/reviews/msgchowdhury.jpg",
  //     text: "আমি সত্যি কাশেম ভাইয়ের কাছে কৃতজ্ঞ কারন উনার কাছে থেকে সব চাইতে বেস্ট কিওয়ার্ড রিসার্চ এবং কম্পিটিশন এনালাইসিস শিখেছি যা বাংলাদেশের কোন ট্রেইনারের কাছে আগে শিখতে পারি নি। আজ ১১ টা ৫৫ ডলারের কিওয়ার্ড রিসার্চ ও কম্পিটিশন এনালাইসিস সেল করলাম। টোটাল তিনটা সেল। ক্লায়েন্ট আমাকে একটা এসইও প্লান পাঠাতে বলেছে যার প্রাইচ ১০০ ডলারের মতো।",
  //     bgColor: bgColors[2]
  //   },
  // ];
  

const testimonials = [
  {
    id: 1,
    title: "",
    name: "Khan Miraj",
    avatar: "/reviews/khan-miraj.jpg",
    text:
      "শেখার জন্য দক্ষতা দরকার। ভিডিও বারবার দেখতে হয়েছে। মুখে তুলে খাওয়ানো নয়, প্র্যাকটিকালি করলে সত্যিকারের লিংক বিল্ডিং শেখা যায়।",
    bgColor: bgColors[0]
  },
  {
    id: 2,
    title: "",
    name: "Rasel Ahmed Raju",
    avatar: "/reviews/rasel-ahmed-raju.jpg",
    text:
      "সত্যিকারের শেখা পেয়েছি। ভিডিও ছোট, কিন্তু খুব ভ্যালুয়েবল। ভ্যালুয়েবল কন্টেন্ট থাকলে সহজেই ভালো লিংক তৈরি করা সম্ভব।",
    bgColor: bgColors[1]
  },
  {
    id: 3,
    title: "",
    name: "Kazi Noor",
    avatar: "/reviews/kazi-noor.jpg",
    text:
      "ভিডিও বারবার দেখতে হবে। সহজভাবে বোঝানো হয়েছে। ক্যারিয়ার, সার্ভিস, মার্কেটপ্লেস শেখানো হয়েছে। এক্সপার্ট হতে চাইলে অবশ্যই করা উচিত।",
    bgColor: bgColors[2]
  },
  {
    id: 4,
    title: "",
    name: "মোঃ আল শাহরিয়ার",
    avatar: "/reviews/md-al-shahriyar.jpg",
    text:
      "নতুনদের জন্য দারুণ গাইড। লিংক বিল্ডিং নিয়ে ভয় দূর হয়েছে। স্পষ্ট, গুছানো শেখানো হয়েছে। ক্যারিয়ার সেটআপেও দিকনির্দেশনা দেয়।",
    bgColor: bgColors[0]
  },
  {
    id: 5,
    title: "",
    name: "Debashis Baidya",
    avatar: "/reviews/debashis-baidya.jpg",
    text:
      "সব কিছু নিখুঁতভাবে দেখানো হয়েছে। স্কাইস্ক্র্যাপার, আউটরিচ, কনটেন্ট তৈরি শেখানো হয়েছে। বাংলায় এমন অ্যাডভান্স কোর্স আগে দেখিনি। করতেই হবে।",
    bgColor: bgColors[1]
  },
  {
    id: 6,
    title: "",
    name: "এম এস এইচ চৌধুরী",
    avatar: "/reviews/msgchowdhury.jpg",
    text:
      "কাশেম ভাইয়ের শেখানো কিওয়ার্ড রিসার্চ দুর্দান্ত। এখন ইনকাম শুরু হয়েছে। তিনটি সার্ভিস বিক্রি করেছি, নতুন প্রজেক্টের প্ল্যানও বানাচ্ছি।",
    bgColor: bgColors[2]
  },
];



  return (
    <section className="bg-white">
      <div className="px-6 md:px-8 lg:px-8 xl:px-8 2xl:px-0 pb-24 max-w-7xl mx-auto ">
        <SuccessStoryClient testimonials={testimonials} />
      </div>
    </section>
  );
};

export default SuccessStory;
