"use client";
import React from "react";
// Import Swiper React components
import { Swiper, SwiperSlide } from "swiper/react";
// Import Swiper styles
import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/pagination";
import { Navigation, Pagination, Autoplay } from "swiper/modules";
import Image from "next/image";
import TestimonialCard from "./TestimonialCard";
import TestimonialItem from "./TestimonialItem";

const testimonials = [
  {
    name: "Khan Miraj",
    image: "/reviews/khan-miraj.jpg",
    review:
      "অবশ্যই রিকোমেন্ড করবো। এখানে কোর্স করার পর যতটুকু বুঝলাম এই কোর্স করতে হলেও একটা যোগ্যতা দরকার। একবার দেখা শেষ করেছি আবার করবো নোট করে করে। এমন ভিডিও আসে ১০ বারের উপরে দেখেছি বুঝার জন্য সেগুলো নিয়ে প্রচুর রিসার্চ করতে হবে। কেউ যদি মনে করে এখানে মুখে তুলে খাওয়ায় দিবে এরকম কোর্স এটা না যে ভিডিও দেখলেন আর হয়ে গেলো। সামনের মাসে লিংকেবল কন্টেন্ট রিসার্চ করে প্রেক্টিকাল স্কাইস্ক্রেপার মেথডে কাজ করার চেষ্টা করবো প্রথম লিঙ্কবিল্ডিং। চেষ্টা করবো সেই রেজাল্ট ও আপনাদের সাথে শেয়ার করার।",
  },
  {
    name: "Rasel Ahmed Raju",
    image: "/reviews/rasel-ahmed-raju.jpg",
    review:
      "এসইওর অনেক টিউটোরিয়াল দেখেছি। নানা রকমের টোটকা পদ্ধতি দেখেছি। কিন্তু প্রায়গিকের কোর্স করে মনে হচ্ছে আসলেই একটি জিনিস শিখলাম যা সারাজীবন কাজে লাগবে। যেখানেই চাকুরী বা ব্যাবসা করি এর প্রভাব আমার সব কাজেই পড়বে। পুরা ফ্যাটলেস টিউটোরিয়াল। কোন অপ্রয়োজনীয় কথা নেই। ভিডিও গুলো ছোট ছোট কিন্তু ভ্যালু ছিল অনেক বেশি। ব্রেইনস্ট্রমিং অটোম্যাটিক শুরু হয়ে যায়। এটা বুঝলাম ভ্যালুয়েবল কন্টেন্ট প্রডিউস করে প্রপারলি আউটরিচ করে লিংক পাওয়া সহজ। এবং সেটা প্রচুর সংখ্যক।",
  },
  {
    name: "Kazi Noor",
    image: "/reviews/kazi-noor.jpg",
    review:
      "সবে মাত্র ভিডিও গুলো দেখা শেষ করেছি। তাতেই বুঝতে পারলাম যে আবারো অনেক বার দেখতে হবে ভিডিও গুলো এবং যে নিখুত ব্যাপার গুলো সহজ ভাবে বোঝানো হয়েছে সেই মোতাবেক কাজ করে যেতে হবে। নিঃসন্দেহে এই কোর্স আপনাকে প্রচলিত লিঙ্ক বিল্ডিং এর সব ধারনা থেকে বের করে নিয়ে আসবে বলে আমার বিশ্বাস। যারা ওয়ার্ল্ড ক্লাস লিঙ্ক বিল্ডিং এক্সপার্ট হতে চায়, তাদের কে আমি এই কোর্স টি অবশ্যই রেকমেন্ড করবো। কারন এতে মার্কেটপ্লেস, ক্যারিয়ার সেটআপ, কিভাবে সার্ভিস সেল করবেন এবং আরও নানান বিষয়ে লেসন দেয়া আছে। সুতরাং এটি নিঃসন্দেহে আপনার জন্য একটি উত্তম কোর্স হবে যদি আপনি একজন ভাল মানের লিঙ্ক বিল্ডিং এক্সপার্ট হতে চান।",
  },
  {
    name: "মোঃ আল শাহরিয়ার",
    image: "/reviews/md-al-shahriyar.jpg",
    review:
      "প্রায়োগিক লিংক বিল্ডিং কোর্সটা এনরোল করার পরেঃনিউবি হিসেবে লিংক বিল্ডিং নিয়ে আমার অনেক কনফিউশন এবং ভয় কাজ করতো।এই বিষয়ে, অনলাইনে খুজেও খুব বেশি রিসোর্স পাইনি, পেলেও বিক্ষিপ্ত আকারে ছিলো। যা দিয়ে খুব একটা আগাতে পারিনি।এক্ষেত্রে, আমাদের দেশে লিংক বিল্ডিং নিয়ে এর আগে এমন গুছানো,ক্লিয়ার কোন কোর্স বা গাইড লাইন পাইনি। এই কোর্সটিতে সবকিছু একটি প্লাটফর্মে পেয়েছি।এই কোর্সটিতে লিংক বিল্ডিং এ ক্যারিয়ার সেট আপ করার ক্ষেত্রেও বিস্তারিত দিকনির্দেশনা দেয়া আছে।সবমিলিয়ে, কোর্সটি খুবই ভালো লেগেছে আমার কাছে।",
  },
  {
    name: "Debashis Baidya",
    image: "/reviews/debashis-baidya.jpg",
    review:
      "প্রথমেই আবুল কাসেম স্যার কে ধন্যবাদ এইরকম একটা কোর্সে আমাদের সুযোগ করে দেওয়ার জন্য। যারা ডিজিটাল মার্কেটিং ফিল্ড এ কাজ করেন, তাদের সবার ই এই কোর্স করা উচিত। লিঙ্ক বিল্ডিং এর অ্যাডভান্স শিখতে হলে এর বিকল্প নেই। এক একটি বিষয় এতো নিখুঁত করে দেখানো আছে যে বার বার ভিডিও গুলি দেখেও সব শেখা হয়ে উঠছে না। এই কোর্স টি প্র্যাকটিস করলেই 6 মাস চলে যাবে বলে আমার ধারণা, সঙ্গে এখন কিভাবে লিঙ্ক বিল্ডিং হচ্ছে তার স্পষ্ট গাইড আছে। আমি শেষ চার বছর ধরে SEO মার্কেটের সঙ্গে যুক্ত, আমার ধারণা বাঙলা ভাষায় এইরকম কোর্স এখনো পর্যন্ত কেউ ই বানাতে পারে নি। সমস্ত অ্যাডভান্স লিংক বিল্ডিং টেকনিক যেমন গেস্ট পোস্ট, স্কাইস্ক্র্যাপের টেকনিক, লিঙ্ক এবলে কনটেন্ট ক্রিটেশন, আউটরীচ ইত্যাদি খুব ই স্পষ্ট ভাবে দেখানো হয়েছে। প্রচলিত লিঙ্ক বিল্ডিং এর ধারণা বদলে যাবে এই কোর্স করলে, তাই কোর্স টি অবশ্যই রেকমেন্ড করবো।",
  },
  {
    name: "এম এস এইচ চৌধুরী",
    image: "/reviews/msgchowdhury.jpg",
    review:
      "আমি সত্যি কাশেম ভাইয়ের কাছে কৃতজ্ঞ কারন উনার কাছে থেকে সব চাইতে বেস্ট কিওয়ার্ড রিসার্চ এবং কম্পিটিশন এনালাইসিস শিখেছি যা বাংলাদেশের কোন ট্রেইনারের কাছে আগে শিখতে পারি নি। আজ ১১ টা ৫৫ ডলারের কিওয়ার্ড রিসার্চ ও কম্পিটিশন এনালাইসিস সেল করলাম। টোটাল তিনটা সেল। ক্লায়েন্ট আমাকে একটা এসইও প্লান পাঠাতে বলেছে যার প্রাইচ ১০০ ডলারের মতো।",
  },
];

const Testimonials = () => {
  return (
    <section className="py-16 sm:py-[100px]">
      <div className="app-container">
        <div className="flex items-center justify-center">
          <h2 className="relative inline-block text-3xl font-bold text-center md:text-4xl lg:text-5xl text-fontcolor-title">
            শিক্ষার্থীদের শেখার অভিজ্ঞতা
            <Image
              src={"/icon/quotes.svg"}
              alt="quotes"
              width={0}
              height={0}
              sizes="40px"
              className="absolute right-0 -top-10 sm:-top-10 sm:-right-10"
            />
          </h2>
        </div>

        <p className="mt-2 text-base text-center text-fontcolor-description mb-14">
          শুধু শেখাই নয়—এই কোর্সগুলো বদলে দিয়েছে ক্যারিয়ার, তৈরি করেছে নতুন
          সম্ভাবনা।
        </p>

        <Swiper
          slidesPerView={1}
          slidesPerGroup={1}
          loop={false}
          keyboard={true}
          spaceBetween={20}
          autoplay={{
            delay: 5000,
            disableOnInteraction: false,
          }}
          pagination={{
            clickable: true,
          }}
          modules={[Navigation, Pagination, Autoplay]}
          className="testimonial-swiper"
        >
          {testimonials.map((data, ind) => {
            return (
              <SwiperSlide key={ind}>
                <TestimonialItem testimonial={data} />
              </SwiperSlide>
            );
          })}
        </Swiper>
      </div>
    </section>
  );
};

export default Testimonials;
