import SectionTitle from "@/components/common/SectionTitle";
import { Button } from "@/components/ui/button";
import { Card, CardContent } from "@/components/ui/card";
import { ArrowRight } from "lucide-react";
import Image from "next/image";
import Link from "next/link";
import QouteIcon from "../_utils/QouteIcon";
import TestimonialModal from "@/components/common/TestimonialModal";

const StudentFeedback = () => {
  const bgColors = ["bg-[#F8F3E9]", "bg-[#E9F8F2]", "bg-[#EEF8E9]"];
  // from facebook
  const primeTestimonials = [
    {
      id: 4,
      title: "",
      name: "আহসান চৌধুরী",
      avatar: "/reviews/facebook/Ahsan Chowdhury.webp",
      text: "নতুন বা মিডলেভেল SEO শিখতে বা দক্ষতা বাড়াতে চাইলে প্রায়োগিক বাংলাদেশের অন্যতম শীর্ষ ই-লার্নিং প্ল্যাটফর্ম। অত্যন্ত প্রফেশনাল ও সুপারিশকৃত।",
      bgColor: bgColors[0],
    },

    {
      id: 2,
      title: "",
      name: "হাসান তৌসিফ",
      avatar: "/reviews/facebook/HaSan-TaWsif.webp",
      text: "প্রায়োগিক প্ল্যাটফর্মটা আমার কাছে একেবারেই ভিন্ন লেগেছে। এখানে শুধু বইয়ের মতো তত্ত্ব না, বরং বাস্তব জীবনে কীভাবে কাজ করতে হয় সেটাই শেখানো হয়। নামের মতোই সত্যিকারের “প্রায়োগিক” শেখা।ভবিষ্যতে তারা যেভাবে আরও কোর্স, আন্তর্জাতিক মানের কনটেন্ট আর ক্যারিয়ার গড়ার সুযোগ তৈরি করতে চাচ্ছে – সেটা সত্যিই অনুপ্রেরণাদায়ক। আমার মনে হয় এই উদ্যোগটা বাংলাদেশের তরুণদের জন্য অনেক দরকার ছিল।আমি যে কোর্সটা করেছি সেটা হলো “আউটবিট লিঙ্ক বিল্ডিং মাস্টার ক্লাস”। ট্রেইনার যেভাবে সহজভাবে বুঝিয়েছেন, তাতে জটিল জিনিসও একদম ক্লিয়ার হয়ে গেছে। সবচেয়ে ভালো লেগেছে – কোর্স শেষ করেই আমি জিনিসগুলো কাজে লাগাতে পেরেছি।শেষ কথা হলো, হ্যাঁ, আমি অবশ্যই প্রায়োগিক অন্যদের রেকমেন্ড করবো। শেখাটা যেমন সহজ, তেমনি কাজে লাগানোও সহজ।",
      bgColor: bgColors[1],
    },
    {
      id: 3,
      title: "",
      name: "তারিক নাহিদ",
      avatar: "/reviews/facebook/Tariq-Nahid.webp",
      text: "আমি প্রায়োগিকের কয়েকটা কোর্স এক্সপ্লোর করেছি, বিশেষ করে SEO আর Outreach সম্পর্কিত। সত্যি বলতে নতুনদের জন্য এগুলো অনেক হেল্পফুল। যেভাবে ধাপে ধাপে বুঝিয়ে বলা হয়েছে, তাতে একদম বেসিক থেকে শুরু করে ইন্টারমিডিয়েট লেভেল পর্যন্ত সবাই সহজেই বুঝতে পারবে।আমার ভালো লেগেছে যে, তারা শুধু থিওরি নয়, বরং রিয়েল এক্সাম্পল দিয়ে শেখানোর চেষ্টা করেছে। মনে হয়েছে, তারা সত্যিই অন্যদের চেয়ে কিছু ভালো দেওয়ার চেষ্টা করেছে।বাংলাদেশে যারা নতুন করে ডিজিটাল মার্কেটিং বা SEO শিখতে চাইছে, তাদের জন্য এই প্ল্যাটফর্মটা ভীষণ কাজে আসবে। আমি অবশ্যই অন্যদেরও প্রায়োগিক রেকমেন্ড করব।",
      bgColor: bgColors[2],
    },
    {
      id: 1,
      title: "",
      name: "আল মাহমুদ",
      avatar: "",
      text: "প্রায়োগিক একটি কার্যকর লার্নিং প্ল্যাটফর্ম, যেখানে সহজ কোর্স, নোটস, কুইজ ও টিপস শিক্ষার্থীদের ক্যারিয়ার উন্নয়নকে সহজ ও আকর্ষণীয় করে তোলে।",
      bgColor: bgColors[1],
    },

    {
      id: 6,
      title: "",
      name: "মোঃ অলিউল্লাহ মির্ধা",
      avatar: "/reviews/facebook/mridha.webp",
      text: "বাংলাদেশের অনলাইন লার্নিং প্ল্যাটফর্মগুলোর মধ্যে আপনাদের কোর্সগুলো সত্যিই আলাদা। সাজানো-গোছানো ছোট ছোট ভিডিওতে শেখা অনেক সহজ হয়েছে। যদি প্র্যাকটিক্যাল অ্যাসাইনমেন্ট আর এমসিকিউ যুক্ত হয়, তাহলে শিক্ষার্থীরা আরও দক্ষ হয়ে উঠবে। আমি নির্দ্বিধায় অন্যদেরও এই প্ল্যাটফর্ম রেকমেন্ড করব।",
      bgColor: bgColors[1],
    },
    {
      id: 5,
      title: "",
      name: "আজাদ আবুল",
      avatar: "/reviews/facebook/Azad Abul.webp",
      text: "যারা নিখুঁতভাবে SEO শিখতে চান তাদের জন্য এটি গুরুত্বপূর্ণ।",
      bgColor: bgColors[0],
    },
    {
      id: 7,
      title: "",
      name: "নজরুল ইসলাম তুহিন",
      avatar: "/reviews/facebook/nazrul-islam-tohin.webp",
      text: "প্রায়োগিকের কোর্সে আমার সেরা অভিজ্ঞতা। ডিজিটাল মার্কেটার ও অনলাইন বিজনেস এর জন্য এই প্লাটফর্ম অনেক কার্যকর। টপিক গুলো সংক্ষিপ্ত ও প্রাকটিক্যাল হয়াতে শেখা সহজ এবং আরও কার্যকর হবে লার্নারদের জন্য। ভিডিও ও অডিও কোয়ালিটি অনেক ভালো। নতুন কিছু শেখার জন্য অনেক উপকারী। ডিজিটাল মার্কেটিং শেখার জন্য অনেক দারুন প্লাটফর্ম। শিক্ষার্থীরা নতুন কিছু বাস্তবে কাজে লাগানোর সেরা প্লাটফর্ম, ইনশাল্লাহ।",
      bgColor: bgColors[1],
    },
    {
      id: 8,
      title: "",
      name: "মোঃ আবু ওবাইদা জায়েদ",
      avatar: "/reviews/facebook/Abu-Obaida-Zayed.webp",
      text: "প্রায়োগিক প্ল্যাটফর্মের উদ্যোগ সত্যিই প্রশংসনীয়। আমাদের মতো শিক্ষার্থীদের জন্য বাস্তব জীবনে প্রয়োজনীয় স্কিল নিয়ে কোর্স করানো হচ্ছে, যা অন্য জায়গায় সচরাচর পাওয়া যায় না। আমি ফেসবুক এ্যাওয়ার্নেস কোর্স করেছি এবং দেখেছি অল্প সময়ের মধ্যে স্পষ্টভাবে মূল বিষয়গুলো তুলে ধরা হয়েছে। শেখার অভিজ্ঞতা খুবই ইন্টারেক্টিভ এবং সহজবোধ্য। ভবিষ্যতে আরও ডিজিটাল মার্কেটিং ও স্কিল ডেভেলপমেন্ট সম্পর্কিত কোর্স এলে তা অনেক উপকারে আসবে বলে মনে করি। আমি অবশ্যই অন্যদেরকে এই প্ল্যাটফর্ম রেকমেন্ড করবো।",
      bgColor: bgColors[0],
    },

    {
      id: 9,
      title: "",
      name: "আরিফুর রহমান",
      avatar: "/reviews/facebook/Arifur Rahman.webp",
      text: "খুবই সুন্দর এবং গুছালো একটি কোর্স বিশেষ করে যারা ব্যাকলিংক এর প্রতি জানতে আগ্রহী এবং ব্যাকলিংক ইন্ডাস্ট্রিতে নিজের ক্যারিয়ার গড়তে আগ্রহী তাদের জন্য এই কোর্সটি আমার মতে মাস্ট করতে হবে কারণ আমি সাধারণত দেশ এবং বিদেশের অনেক কোর্স করেছি তবে এত সুন্দর ক্লিয়ার কনসেপ্ট আসলে কারো কাছ থেকে পাইনি যেটা আমি আবুল কাশেম ভাই এর কাছ থেকে পেয়েছি।আমার কাছে এই কোর্সের সবচাইতে যে জিনিসটা বেশি ভালো লেগেছে সেটা হচ্ছে তার শেখানোর দক্ষতা। আসলে আমরা অনেক জায়গায় অনেকের কাছ থেকে কোর্স করি কিন্তু সবাই সেইভাবে এত সুন্দর ভাবে গুছিয়ে যে উপস্থাপনা করব এত সুন্দর ভাবে বুঝিয়ে বলবে আপনাকে বোঝাবে সে জিনিসটা কিন্তু আসলে সবার মধ্যে না ।  এমনকি আমি নিজেও অনেক সময় অনেক মানুষকে অনেক কিছু বুঝাতে গিয়ে আটকে যাই, আসলে কিভাবে বুঝাবো কিভাবে বুঝলে তারা খুব ভালোভাবে বুঝতে পারবেন এই বিষয়গুলো আমি নিজেও খুব ভালো পারিনা,কিন্তু আমি আবুল কাশেম ভাইয়ের কাছে যখন কোর্স করছি তখন আমার কাছে সবচাইতে সবচেয়ে বেশি ভালো লাগছে তার টিচিং স্কিলস টা, বেশি ভালো লাগছে খুব সুন্দর ভাবে গুছিয়ে এক্সাম্পলস বুঝিয়ে দিতে পারেন এ জিনিসটা সবচাইতে আমার কাছে বেশি ভালো লেগেছ,ছাড়াও আরেকটা জিনিস ভালো লাগে সেটা হচ্ছে যে উনি অনেক ফিউচারিস্টিক মানে ভবিষ্যতের যে কাজকর্মগুলো  কিভাবে হবে, কিভাবে আমাদের নিজেদেরকে ভবিষ্যতের কাজগুলোর জন্য সর্বদা নিজেকে আপডেট রাখতে হবে।কারন আমি এখন যে কাজগুলো করছি যে নিয়মে করছি ভবিষ্যতে সেই কাজগুলো সেই নিয়মে নাও হতে পারে, হয়তো বা নিয়ম পরিবর্তন হতে পারে অথবা কাজের ধরন পরিবর্তন হতে পারে এই বিষয়গুলো মূলত আমাদের সবাইকে জানা উচিত কারণ বিগত তিন চার বছরেও এসইও ইন্ডাস্ট্রিতে যেভাবে কাজ করতো সার্চ ইঞ্জিন আপডেটের ফলে সেই অনেক কাজ অনেক নিয়ম পরিবর্তন হয়েছে অতএব এই পরিবর্তনের সাথে নিজেদেরকে কিভাবে সবসময় আপডেট রাখা যায় এবং সে অনুযায়ী কাজ করা যায় যাতে করে আমাদের ওয়েবসাইট গুলো, গুগোল বা কোন সার্চ ইঞ্জিন আপডেটের ফলে রেংক না হারায় ট্রাফিক যাতে ডাউন হয়ে না যায় সেভাবে করে কিভাবে নিজের স্কিল সবসময় আপডেট রাখা যায় এগুলো খুব সুন্দরভাবে উনি বুঝিয়ে দিয়েছেন যেটা আমার কাছে খুবই ভালো লেগেছে।",
      bgColor: bgColors[2],
    },

    {
      id: 10,
      title: "",
      name: "বাবুল সাহা",
      avatar: "/reviews/facebook/Babul Saha.webp",
      text: "প্রায়োগিক হলো সেরা ডিজিটাল মার্কেটিং সেন্টার।",
      bgColor: bgColors[2],
    },
    {
      id: 11,
      title: "",
      name: "উমর ফারুক",
      avatar: "/reviews/omarfaruk.webp",
      text: "প্রায়োগিকের বহুমুখী কোর্সে অংশগ্রহণ আমার জন্য জ্ঞান ও দক্ষতা বৃদ্ধির এক অসাধারণ অভিজ্ঞতা ছিল প্রায়োগিকের এই উদ্যোগ নিঃসন্দেহে প্রশংসনীয়। আমি মনে করি এই প্লাটফর্মের মাধ্যমে শিক্ষার্থীরা অনেক উপকৃত হবে। আমি শর্ট কোর্স থেকে আমি বাস্তব অর্থেই অনেক জ্ঞান অর্জন করেছি। তাই আমি প্রোয়োগিকের এই প্লাটফর্মের কোর্সগুলো আমি নিরদ্বিধায় রেকোমেন্ড করছি।",
      bgColor: bgColors[0],
    },
    {
      id: 12,
      title: "",
      name: "এআর দিপু",
      avatar: "/reviews/facebook/AR Dipu.webp",
      text: "আমি এখানে হাট লিঙ্ক-বিল্ডিং কৌশল সম্পর্কে একটি স্পষ্ট নির্দেশিকা পেয়েছি।",
      bgColor: bgColors[1],
    },
  ];

  return (
    <div>
      <SectionTitle
        title="কোর্স সম্পর্কে অংশগ্রহনকারীদের  মতামত"
        description="আমাদের কোর্স সম্পর্কে অংশগ্রহণকারীদের নিজস্ব মতামত নিশ্চিত করে যে প্রায়োগিক প্রাইম আপনার ডিজিটাল মার্কেটিং ক্যারিয়ার তৈরিতে প্রয়োজনীয় দক্ষতা ও এক্সপার্টাইজ দেবে।"
      />
      <div className="px-6 md:px-8 lg:px-8 xl:px-8 2xl:px-0 max-w-7xl mx-auto ">
        {/* grid layout */}
        <div className="columns-1 md:columns-2 lg:columns-3 xl:columns-3 gap-4">
          {primeTestimonials.map((testimonial) => (
            <Card
              key={testimonial.id}
              className={`${testimonial.bgColor} border-0 shadow-sm break-inside-avoid mb-6`}
            >
              <CardContent className="p-6 flex flex-col h-full">
                {/* Quote Icon */}
                <div className="mb-4">
                  <QouteIcon />
                </div>
                {/* Testimonial Text */}
                <TestimonialModal testimonial={testimonial} />
                <hr className="mb-4 border-gray-300" />
                {/* Profile Section */}
                <div className="flex items-center gap-3 mt-auto">
                  <div className="relative aspect-square w-10 h-10">
                    <Image
                      src={testimonial.avatar || "/reviews/default.png"}
                      alt={`${testimonial.name}'s profile picture`}
                      width={80}
                      height={80}
                      quality={85}
                      className="rounded-full object-cover w-full h-full"
                      loading="eager"
                      sizes="40px"
                    />
                  </div>
                  <div>
                    <h4 className="font-semibold text-gray-900 text-base">
                      {testimonial.name}
                    </h4>
                    <p className="text-gray-600 text-sm">{testimonial.title}</p>
                  </div>
                </div>
              </CardContent>
            </Card>
          ))}
        </div>

        {/* Show More Button */}
        <div className="flex justify-center mt-12">
          <Link
            target="_blank"
            href="https://www.trustpilot.com/review/prayogik.com"
          >
            <Button
              variant={"default"}
              className="bg-secondary-button hover:bg-secondary-button hover:opacity-95 transition-all duration-300 py-4 h-12 md:flex"
            >
              আরো দেখুন <ArrowRight className="w-5 h-5 ml-1 font-extralight" />
            </Button>
          </Link>
        </div>
      </div>
    </div>
  );
};

export default StudentFeedback;
